[
  {
    "title": "Blood Pressure Tracker",
    "appId": "com.revoke.health.bloodpressure",
    "url": "https://play.google.com/store/apps/details?id=com.revoke.health.bloodpressure",
    "icon": "https://play-lh.googleusercontent.com/xKcUCz__SLHXWx0c6bLw6VTg9_qAp9SEh3GVqx2SgBU9WNRVSM5zAWZavdUwxtwRXi-8JaD8swTs5is4MWDx",
    "developer": "Revoke",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "💖 Blood Pressure Tracker — Your All-in-One Heart Rate, Blood Pressure &amp; Blood Sugar Companion.<br>Safeguarding your well-being with comprehensive tracking and care.<br><br>Core Features — Begin with the Heart, Manage Your Health Scientifically:<br> Heart Rate Logging — Effortlessly record and review your heart health over time.<br> Blood Pressure &amp; Blood Sugar Records — Track daily fluctuations with precision.<br> Smart Trend Analysis — Visual charts offer instant clarity on health patterns.<br><br> Your Trusted Health Companion:<br> Wellness Reminders — Stay on track with timely prompts to drink water, exercise, and rest.<br> Weight Management &amp; Nutrition Tips — Track body changes and receive dietary insights.<br> Mindfulness &amp; Relaxation — Guided meditation and breathing exercises to ease stress.<br>Health Insights — Curated daily tips to enrich your lifestyle and knowledge.<br><br>Why Choose Us?<br>Comprehensive Records — Preserve every vital piece of health information.<br>Intuitive Data Visualization — Instantly grasp your wellness trends.<br>Personalized Recommendations — Tailored advice based on your unique health metrics.<br>Effortless to Use — A clean, friendly interface suitable for all ages.<br><br>💪 Download Blood Pressure Tracker Today<br>Harness the power of data to cultivate peace of mind and a healthier life.<br><br>##Disclaimer##<br>- The app does NOT measure blood pressure or blood sugar.<br>- This application is intended solely for health and lifestyle management and is not designed to diagnose, treat, or prevent any disease. <br>- All content is provided for informational purposes only and should not be considered a substitute for professional medical advice. <br>- If you have any health-related concerns, please consult a qualified healthcare professional promptly.",
    "scoreText": "4.0",
    "score": 3.98,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 1
  },
  {
    "title": "Blood Pressure Tracker",
    "appId": "com.cactus.tracker.bloodpressure",
    "url": "https://play.google.com/store/apps/details?id=com.cactus.tracker.bloodpressure",
    "icon": "https://play-lh.googleusercontent.com/bAiylTmwO8FvtdNsdkEMcDydnaXlQZEPCNgju6AJD-_Cp6Y5huh1yUUj3ErXYZfuZuDl",
    "developer": "AT Technologyy",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Welcome to use Blood Pressure Tracker. This app allows you control your blood pressure, heart rate and blood sugar in a fast, simple and safe way.<br><br>Designed for people who:<br>- Wish to check their blood pressure regularly as needed but occasionally forget to do so<br>- Still record blood pressure and sugar levels on paper<br>- Are uncertain whether their blood pressure, blood sugar, and pulse fall within normal ranges<br>- Want to easily track and analyze changes and trends in their blood pressure, blood sugar, pulse and others<br>- Seek scientific and accurate information and guidance on blood pressure, blood sugar, and maintaining a healthy lifestyle<br>- Need to display blood pressure condition and changes to their doctor<br><br>We suggest you use Blood Pressure Tracker because:<br>1. Record blood pressure, blood sugar and pulse easily: Blood Pressure Tracker is a simple way to record, analyze and observe your data and assist you control your health.<br>2. Track all health data: Get clear analysis of your blood pressure, blood sugar, pulse, water intake, steps and BMI<br>3. Clear history of measurements: You&#39;ll be able to quickly and easily access the history of all your measurements anytime, so as to capture subtle changes in very simple way and take actions accordingly for health improvement.<br><br>DISCLAIMER<br>· The app does NOT measure blood pressure or blood sugar.",
    "scoreText": "3.9",
    "score": 3.8593273,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 2
  },
  {
    "title": "Health Sense: Track & Record",
    "appId": "com.healthapplines.healthsense.bloodsugarhub",
    "url": "https://play.google.com/store/apps/details?id=com.healthapplines.healthsense.bloodsugarhub",
    "icon": "https://play-lh.googleusercontent.com/uwbnQ5qTadNdaRS9hCjVrp1GWR43MU-t_GxkNN12ECCe36yWZHhLwctuGmw3mRhj-mD0z56TJPvK12fpf2GebQ",
    "developer": "Health Applines",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "<b>DO YOU KNOW?</b><br>According to the World Health Organization (WHO), the number of people with diabetes rose from 108 million in 1980 to 422 million in 2014. Diabetes is a major cause of blindness, kidney failure, heart attacks, stroke and lower limb amputation.<br><br><b>Symptoms of diabetes include</b><br>- feeling very thirsty<br>- needing to urinate more often than usual<br>- blurred vision<br>- feeling tired<br>- losing weight unintentionally<br>Over time, diabetes can damage blood vessels in the heart, eyes, kidneys and nerves. Many people with diabetes develop problems with their feet from nerve damage and poor blood flow. This can cause foot ulcers and may lead to amputation.<br><br>Health Sense: Track &amp; Record can help you track your blood sugar, blood pressure, heart rate, and BMI in a fast, simple, and safe way!<br><br><b>Why choose Health Sense: Track &amp; Record?</b><br>❤️ Record health data as you will<br>With a simple input interface, you can record your systolic, diastolic, pulse, blood glucose, steps and water intake at any time and place. It&#39;s a simple way to track and observe your health data and assist your measurements.<br>📊 Track important health data<br>This app will create a personalized health diary for you, and all data will be displayed in the chart. Get clear graphs of your blood sugar, blood pressure, heart rate, and BMI trends to control your levels in a healthy range. We also provide tracker of steps and water intake, help you track important health data as you will.<br>💡 Health insights &amp; knowledge<br>This app doesn&#39;t just help you track your health. You&#39;ll also find a wealth of scientifically proven knowledge, helpful healthy hints and diets concerning blood sugar, blood pressure, heart health, etc., and reliable ways to help you achieve health improvements in the short, mid, and long run.<br><br><br><b>DISCLAIMER</b><br>· Health Sense: Track &amp; Record App should not be used as a medical device in the diagnosis of diabetes or heart diseases.<br>· Health Sense: Track &amp; Record App is not intended for a medical emergency. Consult your primary care physician if you need any help.<br>· In some devices, Health Sense: Track &amp; Record App may make the LED flash very hot.<br>· Health Sense: Track &amp; Record App can not measure your blood pressure or blood sugar.",
    "scoreText": "3.8",
    "score": 3.8497853,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 3
  },
  {
    "title": "Planet Fitness",
    "appId": "com.planetfitness",
    "url": "https://play.google.com/store/apps/details?id=com.planetfitness",
    "icon": "https://play-lh.googleusercontent.com/OICnkECAhWjgkWSy2oBo4DJVE1myjJ5TC1YfdQJi6MMPQgEHvyg2YbuSnM4ENJy1t1ok",
    "developer": "Planet Fitness",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Welcome to the Planet Fitness App: The Gym in Your Pocket!<br>Did you know the PF App has tons of free features everyone? It’s not just Planet Fitness members that can enjoy what the PF App has to offer! We believe fitness should be accessible for all, which is why non-members have access to a huge library of on-demand digital workouts, helpful exercise tutorials for extra guidance, and activity tracking to celebrate wins. You can even sign up for your membership in the PF App without visiting your local club.<br><br>Plus, we have exclusive features for all of our amazing Planet Fitness members like discounts on top brands you love, up to 3 free months through the PF Refer-a-Friend Program**, a Crowd Meter to pick the best time to visit, easy digital check-ins and more! <br> <br>DIGITAL WORKOUTS: FREE FITNESS ON-DEMAND<br>– Motivation: Start &amp; stick with fitness no matter where you are on your unique journey with free workouts led by motivating trainers<br>– Guidance: Enjoy the benefits of Judgement Free fitness &amp; education for all, with or without a membership<br>– Convenience: Get moving anytime, anywhere! On-demand workouts are designed to be completed at home or in the gym.<br>– Variety: Browse workouts by type, time, target, and more to find what’s best for you, whether you’re looking for a workout for beginners or want to try something new!<br> <br>EQUIPMENT &amp; EXERCISE TUTORIALS: GUIDANCE WHEN YOU NEED IT<br>– Easy-to-follow equipment tutorials &amp; exercise movements to perfect your form and not be intimidated by equipment at home or in the gym<br> <br>FITNESS TRACKING: CELEBRATE YOUR WINS<br>– Record how much you’re moving with the free Activity Tracker with a variety of in &amp; out of gym activities, available for members AND non-members<br>– Fill out the “About Me” section to customize your fitness profile and receive personalized workout video recommendations, no membership required<br>– Members can track check-ins in the “My Journey” tab. We’ll celebrate small wins together–just keep showing up!<br>DISCOUNTS FOR MEMBERS: SAVE ON TOP BRANDS YOU LOVE<br>– Make your fitness journey more rewarding when you save big with deals &amp; discounts on your favorite brands across apparel, food &amp; drink, travel, and more!***<br><br>MEMBER SAVINGS: FITNESS WITH FRIENDS<br>– Planet Fitness members earn free months through our Refer-a-Friend program<br>– Every friend that joins earns you 1 free month of membership** and your friends can join for only $1 down. Now that’s a win-win!<br><br>CROWD METER: A WORKOUT THAT WORKS FOR YOU<br>– Planning to squeeze in a workout? Pick the best time of day to visit the gym with our Crowd Meter! <br><br>CLUB CHECK-INS: SEAMLESS, TOUCHLESS ENTRY <br>– Check-in quickly &amp; easily at your Planet Fitness home club with your digital Club Pass<br><br>PF BLACK CARD® MEMBERSHIP: ALL. THE. PERKS.<br>– Upgrade to our most popular membership right in the PF App for even more member benefits<br>– Enjoy PF Black Card® perks including use of any Planet Fitness worldwide, bringing a guest every time you work out, access to premium PF+ workouts &amp; discounts, use of the Black Card Spa® where you can relax in massage chairs &amp; HydroMassage™—and much more!****<br>  <br>Download the FREE Planet Fitness App today – You got this!<br> <br>**Up to a maximum of three (3) total months of membership per calendar year. Visit https://www.planetfitness.com/referrals-terms-conditions for more information.<br>***Restrictions and exclusions may apply. Valid at participating locations only. Offers valid on select products only, see specific offer for details. <br>****Services and perks subject to availability and restrictions. State and local restrictions on tanning frequency with PF Black Card® memberships apply. Participating locations only. See club for details.",
    "scoreText": "4.7",
    "score": 4.6747375,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 4
  },
  {
    "title": "Blood Pressure",
    "appId": "com.bpfit.bloodpressure.health",
    "url": "https://play.google.com/store/apps/details?id=com.bpfit.bloodpressure.health",
    "icon": "https://play-lh.googleusercontent.com/iJI-Hm3u_VEhVJomRiLbuTIdRkohgXssrDWAB3gxGR1h6qwQiSlGEfhL-cYmBb8NJA",
    "developer": "P & L Studio",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Blood Pressure is your perfect companion for recording blood pressure data. It can help you easily record your blood pressure data and view your blood pressure data trends at any time.<br><br>The main function:<br><br>We mainly provide you with the function of recording blood pressure data. You can easily record your blood pressure data so that you can view your blood pressure data trends and history.<br><br>At the same time, we also provide you with the function of recording blood sugar data. If you need, you can also easily record your blood sugar data in the app to facilitate you to manage and view your historical blood sugar data.<br><br>Health information: You can read and learn some blood pressure-related knowledge in the app.<br><br>Disclaimer<br><br>1. This app will not measure your blood pressure or blood sugar and is not suitable for medical emergencies. If you need any help, talk to your doctor.<br><br>2. The information provided using this application is only intended to provide general summary information to the public and is not intended to replace written laws or regulations. This app does not provide health professional guidance. If you require health professional guidance, please consult a professional medical provider or physician.",
    "scoreText": "3.8",
    "score": 3.7886598,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 5
  },
  {
    "title": "Lazy exercise at home",
    "appId": "swiftflyers.homeworkout.chair.floor.bed.exercise.forlazy",
    "url": "https://play.google.com/store/apps/details?id=swiftflyers.homeworkout.chair.floor.bed.exercise.forlazy",
    "icon": "https://play-lh.googleusercontent.com/DviP2J9pMwd6SGexXedBSHO3yj402Vjd9XL9EcctHsKp2JiTz9bFEM-iRK-FI8ZA5jIe",
    "developer": "SWIFTFLYERS",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Discover a personalized program designed to help you achieve safe and effective weight loss from the comfort of your home. Our structured workouts and customizable meal plans provide a holistic approach to enhancing your health and fitness. Supported by scientific research, this program is proven to yield results. Stay dedicated, and you’ll experience a transformation that boosts your confidence and makes you feel more beautiful than ever.<br><br>Our all-encompassing workout plan focuses on key areas like arms, glutes, abdomen, and legs, enabling you to lose those stubborn pounds and shape your physique. With detailed animations and video instructions, you can maintain proper form throughout each exercise. The best part? No equipment is necessary, allowing you to conveniently fit your workouts into your day, whether at home or on the go. Start your body transformation journey today!<br><br>Get Fit Anytime, Anywhere - No Equipment Required! This straightforward program takes just 4-8 minutes of your day, making it easy to adhere to. As you embark on your weight loss journey with us, you’ll see visible changes. Are you ready to begin?<br><br>Explore More Exciting Features:<br><br>· No Equipment Needed: Work out wherever and whenever you want.<br>· Customized Plans: Quickly lose weight and tone up, focusing on your trouble spots.<br>· Free Access: No payment is required to start your journey.<br>· Effortless Self-Discipline: Just 4-8 minutes a day, easy to follow and maintain.<br>· Low-Impact Options: Perfect for post-injury recovery.<br>· Workout Reminders: Stay motivated with reminders to help you meet your daily goals.<br>· Progress Tracking: Easily monitor your weight loss and calories burned.<br><br>Experience the Unique Benefits of Lazy Exercise at Home:<br>⭐ Personalized Plans: Get plans tailored specifically for your fitness journey.<br><br>⭐ Targeted Workouts: Concentrate on abs, chest, glutes, legs, arms, or enjoy full-body sessions.<br><br>⭐ No Equipment Necessary: Exercise anytime, anywhere—at home, at work, or outdoors.<br><br>⭐ Expertly Designed Routines: Benefit from high-quality workouts crafted by fitness professionals.<br><br>⭐ Diverse Workout Options: Choose from a variety of workouts that suit your preferences and goals.<br><br>⭐ Clear Instructions: Receive straightforward guidance for each exercise to ensure correct form.<br><br>⭐ Smart Progress Tracker: Visualize your fitness journey and monitor your progress to stay motivated.<br><br>⭐ Daily Reminders: Keep on track with regular prompts to help you maintain a consistent routine.<br><br>Take a few minutes each day for self-care and dive into the world of Lazy Exercise at Home! Achieve a leaner, more toned, and healthier body while fostering a positive minds",
    "scoreText": "4.3",
    "score": 4.3129253,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 6
  },
  {
    "title": "Yuka - Food & Cosmetic Scanner",
    "appId": "io.yuka.android",
    "url": "https://play.google.com/store/apps/details?id=io.yuka.android",
    "icon": "https://play-lh.googleusercontent.com/fmGc9NGmf0ZTV2PQIhZ7lprvqNaUOaZEFXZg6MIG5fDaUiTua4Y2D7IxA3jaHDj2xQ",
    "developer": "Yuka App",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "◆ 77 MILLION USERS ◆<br><br>Yuka scans food, beauty &amp; personal care products to decipher their ingredients and evaluate their impact on your health.<br><br>In a world of incomprehensible labels, Yuka provides clarity in one quick scan so you can make clear-sighted purchases.<br><br>Yuka uses a simple color code to inform you of the product&#39;s impact on your health: excellent, good, mediocre, or poor. You can access a detailed info page for each product, to help you understand its grade.<br><br>◆ 4 MILLION FOOD PRODUCTS ◆<br><br>Every product is evaluated according to 3 objective criteria: nutritional value, additives, and the organic dimension of the product.<br><br>◆ 2 MILLION BEAUTY PRODUCTS ◆<br><br>The scoring method relies on analyzing all of the product&#39;s ingredients. Every ingredient is assigned a level of risk, based on current scientific research.<br><br>◆ BEST PRODUCT RECOMMENDATIONS ◆<br><br>For any product with a negative grade, Yuka will recommend in total independence a similar product that&#39;s better for your health as an alternative.<br><br>◆ 100% INDEPENDENT ◆<br><br>Yuka is a 100% independent application. This means that product evaluations and recommendations are completely objective: no brand or manufacturer can influence them in one way or another. In addition, the application does not advertise. Find out more about our funding on our website.<br><br>---<br>Terms of use: https://yuka-app.helpdocs.io/l/en/article/2a12869y56",
    "scoreText": "4.8",
    "score": 4.763629,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 7
  },
  {
    "title": "Finch: Self-Care Pet",
    "appId": "com.finch.finch",
    "url": "https://play.google.com/store/apps/details?id=com.finch.finch",
    "icon": "https://play-lh.googleusercontent.com/fsYShU5YDNZxBQgZF-UjT-cq7Mxtqmz71_Q8isHj3DzpOX9Me4KZLD780Oe2DxTRVPzA76xlDNigl9SXjEsPfw",
    "developer": "Finch Care Public Benefit Corporation",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Meet your new self-care best friend! Finch is a self-care pet app that helps you feel prepared and positive, one day at a time. Take care of your pet by taking care of yourself! Choose from a wide variety of daily self-care exercises personalized for you.<br><br>BEST DAILY SELF-CARE TRACKER ✨<br>Is self-care a chore? Struggling with habits, self-love, or depression? Self-care finally feels rewarding, lightweight, and fun with Finch. Complete quick self-care exercises to grow your pet, earn rewards, and improve mental health! People who struggle with mood journaling, habits, and depression found it easier to be mindful with their self-care pet in Finch!<br><br>EASY DAILY CHECK INS ✏️<br>• Start mornings with quick mood checks and energize your pet to go exploring! Choose from various mindful habits from goal tracking and mood journaling to mindful breathing exercises and quizzes!<br>• End days in moments of gratitude with your self-care pet where they&#39;ll return from adventures to share stories with you! Recognize positive moments and grow your self-love.<br><br>MINDFUL HABITS 🧘🏻<br>Finch is the fun self-care tracker to hit goals and sustain healthy habits! Build mental resilience against stress, anxiety, and depression. Strengthen your mental health by increasing self-love and gratitude.<br><br>• Habit Tracker: set goals and celebrate wins for healthy habits.<br>• Mood Journal: guided mood journal to clear the mind, track important moments, and practice self-love.<br>• Breathing: guided breathing to calm nerves, increase focus, energize your mind, and sleep better.<br>• Quizzes: understand your mental health with quizzes for anxiety, depression, body image appreciation, and more.<br>• Mood Tracker: quick mood checks with mood trends to understand what has been lifting you up or bringing you down.<br>• Quotes: motivational quotes to lift your mood and gain new perspective.<br>• Insights: get insights on your mental health from combined analytics on your mood journaling, tags, goal tracker, and quizzes.<br><br>SAY HI 👋🏼<br>• TikTok: https://www.tiktok.com/@finchcare<br>• Discord: https://discord.gg/finchfam<br>• Instagram: https://www.instagram.com/finchcare/<br>• Facebook: https://facebook.com/groups/finchfam<br>• Email: support@befinch.com",
    "scoreText": "4.9",
    "score": 4.9033384,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 8
  },
  {
    "title": "AllTrails: Hike, Bike & Run",
    "appId": "com.alltrails.alltrails",
    "url": "https://play.google.com/store/apps/details?id=com.alltrails.alltrails",
    "icon": "https://play-lh.googleusercontent.com/u9GH1z_4T_YrQFA8OcgTUqUeaRU9Sh99i2ptfrpwTvEhvw3etf7L0MGzABgjJ_b4U9o",
    "developer": "AllTrails, LLC",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Whether you hike, bike, run, or walk, AllTrails is your companion and guide to the outdoors. Find detailed reviews and inspiration from a community of trailgoers like you. We’ll help you plan, live, and share your outdoor adventures.<br><br>AllTrails offers more than a running app or fitness activity tracker. It helps you discover dog-friendly, kid-friendly, stroller-friendly, or wheelchair-friendly trails, and more with turn-by-turn navigation to guide you through it.<br><br>◆ Discover trails: Search over 500,000 trails around the world by location, interest, skill level, and more.<br>◆ Plan your next adventure: Get in-depth trail info, from reviews to conditions to GPS driving directions — and save your favorite trails for later.<br>◆ Stay on course: Stick to your planned route or chart your own course with confidence when you navigate on the trail with your phone or Wear OS device. Use Wear OS to leverage tiles and complications to start and monitor your activities.<br>◆ Find points of interest: Discover waterfalls, historic sites,  photo spots, and more along the trail.<br>◆ Grow your community: Celebrate outdoor adventures and find inspiration by connecting with trailgoers like you.<br>◆ Share your outdoor adventures: Easily post trails and activities on Facebook, Instagram, or WhatsApp.<br>◆ Record your activity: Capture your stats, leave reviews, and post photos of your favorite hiking trails.<br><br><br>Discover trails that fit your nature. Trails for workout planners, hikers, walkers, mountain bikers, trail runners, and casual cyclists. Whether you’re pushing your limits or pushing a stroller, there’s something out there for everyone. Let AllTrails help you find it.<br><br>► Do more outdoors with AllTrails Plus ►<br>Spend less time figuring out where you want to be, and more time enjoying where you are. With offline maps, wrong-turn alerts, and extra safety and planning features, your annual subscription gives you more tools for more adventures.<br><br>◆ Search by distance from you to find the closest trails.<br>◆ Plan for the elements like ground conditions, weather, air quality, UV index, and more.<br>◆ See how conditions change along the trail and preview by time of day.<br>◆ Unplug completely or pack a backup with printed maps.<br>◆ Explore without service with map downloads for trails, parks, and entire areas.<br>◆ Live share your trail activity with friends and family.<br>◆ Prepare for the hills ahead: Follow topo maps and trail maps in 3D.<br>◆ Focus on the view, not the map, with wrong-turn alerts.<br>◆ Give back: AllTrails donates a portion of every subscription to 1% for the Planet.<br>◆ Explore ad-free: Remove occasional ads by subscribing<br><br>► New! Explore to the fullest with AllTrails Peak ►<br><br>Make the most of your time on the trail with our newest premium membership. Chart your own course, plan ahead for conditions, and explore popular trails — with all the offline benefits of Plus.<br><br>◆ Create your own route from scratch, or modify one of 500,000+ existing trails.<br>◆ Explore the most popular places with heatmaps of recent trail activity.<br>◆ Access every Plus and Base feature, too.<br><br>Whether you’re geocaching in a national park, browsing bucket-list mountain bike routes, or planning a trail run to clear your head, AllTrails Plus and Peak make the great outdoors even greater.",
    "scoreText": "4.6",
    "score": 4.6422186,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 9
  },
  {
    "title": "Blood Sugar & Diabetes Tracker",
    "appId": "com.bloodsugar.diabetes.tracker.pro",
    "url": "https://play.google.com/store/apps/details?id=com.bloodsugar.diabetes.tracker.pro",
    "icon": "https://play-lh.googleusercontent.com/4qu1cDpMfUmhUpAGp4g5dwX63kitJaDJbUoJcGbHV27qK_ylHO7yUcdHC1IeSDvDp74",
    "developer": "PidomTech",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Blood Sugar &amp; Diabetes Tracker is your personalized health companion designed to help you manage your blood sugar levels. <br><br>Key Features:<br><br>🌟Comprehensive Blood Sugar Tracking:<br>- Easily log and monitor your blood sugar levels.<br>- Get personalized insights and trends based on your blood sugar data.<br><br>🌟Diabetes Management:<br>- Track your blood sugar levels.<br>- Access detailed reports that you can share with your healthcare provider for better diabetes management.<br><br>🌟Health Insights:<br>- Analyze patterns and trends in your blood sugar levels to understand what affects your health.<br>- Receive personalized recommendations to help you maintain stable blood sugar levels.<br><br>🌟User-Friendly Interface:<br>- Intuitive and easy-to-navigate design for a seamless user experience.<br>- Customizable reminders and alerts to keep you on track with your diabetes care.<br><br>🌟Educational Resources:<br>- Access a wealth of information and tips on managing diabetes and maintaining a healthy lifestyle.<br>- Stay informed with the latest research and guidelines on diabetes care.<br><br>Note:<br>Blood Sugar &amp; Diabetes Tracker is designed to help you manage your diabetes by tracking and analyzing your blood sugar levels. It is not a substitute for professional medical advice, diagnosis, or treatment. Always consult your healthcare provider if you have any concerns about your health.<br><br>Take charge of your diabetes management today with Blood Sugar &amp; Diabetes Tracker. Download now and start your journey towards better health and well-being.",
    "scoreText": "3.3",
    "score": 3.2666667,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 10
  },
  {
    "title": "Sleep Tracker - Smart Alarm",
    "appId": "com.sleeptracker.night.pattern.tracker",
    "url": "https://play.google.com/store/apps/details?id=com.sleeptracker.night.pattern.tracker",
    "icon": "https://play-lh.googleusercontent.com/M6JHyak334naKBUXsXTfcthTHXfh3ZDPxlbGA6EeY9_2wycFYoArCf_pVoeRA1kple5KN0ckkON7M_9Gk9JC",
    "developer": "FAT BR",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Sleep Tracker - Smart Alarm is your all-in-one sleep companion that helps you relax, monitor your sleep cycle, and wake up refreshed every morning. This smart sleep tracker combines advanced sleep analysis, white noise and relaxing sleep sounds to create a peaceful bedtime routine for better rest.<br><br>😴 Track Your Sleep Easily<br>Record your nights with the accurate sleep tracker and sleep monitor. Review your sleep analysis to understand your habits and improve sleep quality.<br><br>⏰ Wake Up Smart<br>Wake up gently with the smart alarm clock that syncs with your sleep tracker to help you start the day naturally energized.<br><br>🎧 Relax with White Noise &amp; Sleep Sounds<br>Fall asleep faster with peaceful white noise, soft sleep sounds, rain sounds and nature sounds. Mix your favorite sounds or use sleep music to create your perfect sleep space.<br><br>📖 Enjoy Bedtime Stories &amp; Meditations<br>Unwind with bedtime stories, guided meditation and gentle sleep meditations to release daily stress and prepare for a deep sleep.<br><br>🎤 Snore Tracker &amp; Sleep Recorder<br>Use the snore tracker and sleep recorder to detect noises or snoring that affect your sleep.<br><br>✨ Why Choose Sleep Tracker - Smart Alarm?<br>- Simple and accurate sleep tracker with full sleep analysis  <br>- Large library of white noise, sleep sounds and nature sounds  <br>- Relaxing features: sleep meditations, guided meditation and bedtime stories  <br>- Smart tools: snore tracker, sleep recorder and smart alarm clock  <br><br>With Sleep Tracker - Smart Alarm, you’ll enjoy deeper, healthier rest every night - from precise sleep tracking to peaceful relaxing sounds and intelligent wake-up tools.<br>🌙 Embrace calm nights and refreshed mornings with your all-in-one sleep companion.",
    "scoreText": "3.6",
    "score": 3.6,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 11
  },
  {
    "title": "Blood Pressure App",
    "appId": "com.mearsure.heartratepro.manage",
    "url": "https://play.google.com/store/apps/details?id=com.mearsure.heartratepro.manage",
    "icon": "https://play-lh.googleusercontent.com/qpOaO6F7jhQIC6tHsQ09D3n_nCurNwP0EfYjDEIDoPPFm3ZVqLHdL98i4c4WWl7sFQ",
    "developer": "P & L Studio",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Blood Pressure App is an application that covers recording blood pressure, blood sugar and BMI, which can help you record your own health data.<br><br>1. Blood pressure<br>You can record your blood pressure data through Blood Pressure App, and observe your blood pressure trend through graphs.<br><br>2. Blood sugar<br>You can record your blood sugar data through Blood Pressure App, and observe your blood sugar trend through graphs.<br><br>3. BMI: You can enter your weight and height to calculate whether your BMI value is within a reasonable range.<br><br>4. Health information: You can learn some knowledge including blood pressure, blood sugar in the application.<br><br>Disclaimer<br><br>1. This app does not measure your blood pressure, blood sugar, and is not intended for medical emergencies. Consult your doctor if you need any help.<br><br>2. The information provided using this application is only intended to provide general overview information to the public and is not intended to replace written laws or regulations. This app does not provide health professional guidance. If you need health professional guidance, please consult a professional medical institution or physician.",
    "scoreText": "3.9",
    "score": 3.9364822,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 12
  },
  {
    "title": "My Water Tracker & Reminder",
    "appId": "com.water.tracker.remind",
    "url": "https://play.google.com/store/apps/details?id=com.water.tracker.remind",
    "icon": "https://play-lh.googleusercontent.com/-oULgUQI4QD5BuKiCypgVnoRDD-3U2EUVVj9lpVpXc2Ok8NABBRDbiF7Oixk4um47tUm",
    "developer": "Reminders & Alarms",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Stay on top of your hydration goals and build a healthy lifestyle with the best drink water reminder app. Whether you&#39;re tracking your daily water intake, managing hydration during intermittent fasting, or simply aiming to stay consistent, this smart hydration tracker is your all-in-one solution.<br><br>Our app helps you maintain hydration, reach daily goals, and even support your water fast — all in a simple, user-friendly experience.<br><br>Why My Water Tracker &amp; Reminder?<br>My Water Tracker &amp; Reminder is designed to help you develop and maintain better water habits. Whether you’re starting a hydration journey, exploring water fasting, or following a structured routine like 8 cups of water a day, this app empowers you to stay accountable and consistent.<br>Top Features of Our Water Reminder App:<br>- Drink Water Reminder: Get personalized alerts based on your schedule and activity level. Never forget to hydrate again.<br>- Track Water Intake Easily: Log every glass you drink with just a tap.<br>- Hydration Tracker: Visualize your progress and stay motivated to complete your daily water intake goals.<br>- Customizable Goals: Set personalized water targets depending on your health, weight loss goals, or fitness routine.<br>- Water Fast Support: Whether you&#39;re following intermittent fasting or water-only fasts, gentle reminders help you stay on track without distractions.<br>- Completely Free App: Access all water tracking features from day one, with no hidden costs or upgrades.<br><br>Built for Everyone — From Beginners to Health Enthusiasts<br>This app is great for anyone looking to:<br>- Lose weight or manage appetite through proper hydration<br>- Improve skin and energy levels with consistent water intake<br>- Use a hydration app during fasting or wellness programs<br>- Support healthy kidneys, digestion, and joint function<br>- Follow structured routines like &quot;8 glasses of water a day&quot;<br><br>Whether you’re searching for a drink water app, water drinking reminder, or hydration app — this tracker combines all of these into one seamless solution.<br><br>Made to Fit Your Lifestyle<br>Unlike generic health trackers, this app adapts to you. Customize everything from your reminder schedule and intake tracking to your notification style. You can even track hydration for different containers — bottles, cups, or ounces — and see trends over time.<br>- Designed for everyday use — no clutter, no confusion<br>- Smart alerts for your water intake tracker routine<br>- Track hydration progress visually<br>- Great for beginners &amp; experienced users alike<br>- Works for fitness, wellness, or water fast routines<br><br>Real Results Through Simplicity<br>Our users have reported feeling more energized, fewer headaches, better digestion, and even more consistent fasting results. With features like drink water reminder free, hydration tracker, and daily stats, this app makes hydration automatic.<br><br>Want to track more than water? Our companion features also work with other health routines, like meal planning or intermittent fasting — and you can integrate with your fitness goals to build a stronger, more resilient lifestyle.<br><br>Your Smart Water Companion<br>Ideal for anyone searching for:<br>- Drink water reminder<br>- Free water tracker app<br>- Hydration app<br>- Water fast support<br>- Smart water reminder free features<br>- Water intake tracker<br>- Water reminder alarm<br>- Daily hydration goal tracker<br><br>Whether you know it as a water reminder, drink water tracker, or hydration assistant — My Water Tracker &amp; Reminder makes daily hydration simple, efficient, and rewarding.<br><br>Download now and start building your hydration habit today.",
    "scoreText": "4.7",
    "score": 4.691495,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 13
  },
  {
    "title": "healow",
    "appId": "com.ecw.healow",
    "url": "https://play.google.com/store/apps/details?id=com.ecw.healow",
    "icon": "https://play-lh.googleusercontent.com/TezJmNU0-tBKA7Ae2tFyH0U8nP_36k6NQ6GtSXFoDUCRKzj1TqHO6fHbBv0EHicPEqg",
    "developer": "eClinicalWorks LLC",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Healow App is a convenient mobile tool that helps patients access health information and communicate with their providers to stay engaged, motivated, and make healthy choices. With the healow app, patients can easily:<br><br> Message the care team – Contact care team through quick, secure direct messages.<br>View test results – Access labs and other test results as soon as they become available.<br>Self-schedule appointments – Book appointments with the care team and view upcoming visits beyond regular office hours.<br>Check in before the visit – Easily check in for appointments and save time by completing any necessary documentation before arrival.<br>Attend virtual visits –Initiate and attend telehealth visits with members of the care team.<br>View medications, set medication reminders,  and request for refills without calling the doctor.<br>View medical history including allergies, immunizations, vitals, visit summary, and other health information.<br>Monitor vitals and meet health goals using weight management, activity, fitness, and sleeping tracking tools to track readings and watch for trend changes to share with the doctor.<br>Manage and view multiple family member’s health records under one account.<br> <br><br>Please note that patients must have an existing healow Patient Portal account with their doctor’s office. Once downloaded and launched, the patient must log in using the username and password used to access the provider’s healow Patient Portal website to begin using the app. It will ask the user to create a pin and enable Face ID or Touch ID. Enabling either of these features will save the user from having to enter their login information every time they want to use the app.",
    "scoreText": "4.6",
    "score": 4.6122265,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 14
  },
  {
    "title": "Flo Ovulation & Period Tracker",
    "appId": "org.iggymedia.periodtracker",
    "url": "https://play.google.com/store/apps/details?id=org.iggymedia.periodtracker",
    "icon": "https://play-lh.googleusercontent.com/S2NYJ-zQxMfCGe4NyP_jRQmoNHeLB0TwlDqNSA6BKKWgm3GHWVhbXiLpejzyiLkAG7qM",
    "developer": "Flo Health Inc.",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Welcome to Flo! The world’s leading period, pregnancy, and cycle tracker. Join over 430 million members who use Flo as their go-to pregnancy &amp; ovulation tracker &amp; cycle calendar. With seven million five-star ratings, we&#39;re paving the way to better female healthcare by empowering people with periods to harness their body&#39;s signals.<br><br><b>Flo for Partners</b><br>Link your Flo account with your partner so they can see updates on your cycle and pregnancy. Period and fertile days predictions, we&#39;ll provide them with insights and actions they can take to support you better. Use Flo for Partners to maximize your connection when tracking your period, ovulation, or pregnancy.<br><br><b>There&#39;s more to tracking your period:</b><br>- <b>Menstrual and Period Tracker</b>: Understand symptoms like vaginal discharge and mood swings by tracking your period with Flo&#39;s ovulation and period calendar, developed in collaboration with over 100 health experts.<br>- <b>Ovulation &amp; Fertility Window Tracker</b>: Understand your fertile cycle and benefit from expert insights, tailored content, and information about conception and fertility.<br>- <b>Women&#39;s Health Tracker</b>: This is a calendar for your cycle, ovulation, weight, water intake, physical activity, and mood. Track your symptoms to prepare for your period.<br>- <b>Pregnancy Tracker App</b>: Receive expert information for a healthy pregnancy and birth with Flo&#39;s pregnancy calendar.<br>- <b>New! Flo supports perimenopause:</b> Know what might be perimenopause and how to tune in to your body’s changes. Get clarity on common perimenopause symptoms and what can help.<br><br><b>How to maximize your use of Flo’s menstrual, period, and ovulation tracker and calendar:</b> <br>- Anonymous Mode: Enjoy Flo while maintaining your privacy and protecting your identity. Your name, email address, and technical identifiers will not be connected to your health data in your new Flo account.<br>- Reminders: Personalize Flo&#39;s menstrual and period tracker with scheduled reminders to track your cycle&#39;s start and end date. Receive notifications about ovulation, birth control pills, sleep, water intake, and more.<br>- Secret Chats: Safely discuss intimate topics from fertility to birth control in our supportive global community.<br>- Content Library: Explore thousands of articles and videos on women&#39;s health, periods, ovulation, birth control, fertility, and pregnancy.<br>- Health Assistant: Chat with our virtual assistant about late periods, irregular cycles, PMS, etc.<br>- Check if symptoms match those common of PCOS, endometriosis, or perimenopause with our Symptom Checker tool.*<br>- Wear OS complications &amp; tiles: Set up a tile and complication on your watch for insights about your cycle. Flo period tracker is compatible with Wear OS 3. <br>- Use your tax-free funds on a subscription: Flo Premium memberships can be purchased using FSA/HSA dollars.**<br><br>Please note: Flo is not a diagnostic tool and should not be used as a method of contraception or to facilitate conception. Predictions and insights provided by the app are intended for informational purposes only and are not a substitute for professional medical advice, diagnosis, or treatment. Always consult a qualified healthcare provider for any health concerns or decisions.<br><br>Contact <b>support@flo.health</b> for assistance.<br><br>To access our accessibility statement, visit: https://flo.health/accessibility-statement-android?current-location=auto-detect<br><br>*Not available in the UK or EU/EEA.<br>**As of October 12, 2024. Following the SIGIS Eligible Product List. US only. Some FSA/HSA plan providers have different eligibility rules. Contact your provider in advance.",
    "scoreText": "4.7",
    "score": 4.713076,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 15
  },
  {
    "title": "Calm - Sleep, Meditate, Relax",
    "appId": "com.calm.android",
    "url": "https://play.google.com/store/apps/details?id=com.calm.android",
    "icon": "https://play-lh.googleusercontent.com/S76GphUu2pZa249td2Bb4XAhLcPRrFdL1zp_5qU1ouukvRq9r0-8jJ-CruaTtdT6g84",
    "developer": "Calm.com, Inc.",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Calm is the #1 app for sleep, meditation and relaxation. Manage stress, balance moods, sleep better and refocus your attention. Guided meditation, Sleep Stories, soundscapes, breathwork and stretching exercises fill our extensive library. Practice self-healing and discover a happier you through Calm.<br> <br>Feel better by reducing anxiety, prioritizing your self-care and choosing a guided meditation session that fits within your busy schedule. Introduce mindfulness and breathing exercises into your daily routine and experience their life-changing benefits. Meditation novice or seasoned expert, Calm is for anyone who is looking to improve their sleep and address everyday stress.<br> <br>Sleep better with Sleep Stories, bedtime stories that lull you into a restful slumber. Relaxing sounds and calming music also help you meditate, focus and sleep soundly. Balance your mood and improve your sleep cycle by picking from 100+ exclusive Sleep Stories, narrated by well-known talent like Cillian Murphy, Rosé, and Jerome Flynn. Meditate daily to relieve anxiety and learn to put your personal health first.<br> <br>Take a deep breath and find your Calm.<br> <br>CALM FEATURES<br> <br>MEDITATION &amp; MINDFULNESS<br>* Meditate with seasoned experts, regardless of your experience level<br>* Be mindful in your daily routine and learn to calm your thoughts<br>* Mindfulness topics include Deep Sleep, Calming Anxiety, Focus and Concentration, Breaking Habits and so much more<br> <br>SLEEP STORIES, RELAXING MUSIC &amp; SOUNDSCAPES<br>* Sleep soundly listening to Sleep Stories, bedtime stories for adults and children alike<br>* Tackle insomnia with calming music, sleep sounds and full soundscapes<br>* Self-care: Sleep content to help you relax and get into a state of flow<br>* Relax and experience deep sleep with new music added every week, from top artists<br> <br>ANXIETY RELIEF &amp; RELAXATION<br>* Stress management and relaxation with daily meditation and breathing exercises<br>* Self-healing through Dailies - Reduce anxiety with daily 10-minute original programs like the Daily Calm with Tamara Levitt or the Daily Trip with Jeff Warren<br>* Mental health is Health - Tackle social anxiety and  personal growth through inspiring stories<br>* Self-care through mindful movement: Relax your body during the day with Daily Move<br> <br>ALSO FEATURING<br>* Emotion and mental health tracker through Daily Streaks &amp; Mindful Minutes<br>* Feel better with 7- and 21-day mindfulness programs for beginner &amp; advanced users<br>* Soundscapes: Nature sounds and scenes to calm your nerves<br>* Breathing exercises: Find peace and concentration with a mental health coach<br> <br>Calm is free to download and use. There are never any ads and some of the programs and features are free forever. Some content is only available through an optional paid subscription. If you choose to subscribe, payment will be charged to your Google Account at confirmation of purchase.<br> <br>Be sure to check out our Wear OS app with tiles to quick-start breathing exercises and complications that help you track meditations.<br><br>What is Calm?<br>Our mission is to make the world a happier and healthier place. Through our website, blog, and app—filled with meditations, sleep stories, music, movement, and more—we’re redefining what mental health care looks like in 2021 and beyond. With over 100 million users worldwide, 100,000 new users daily, and our growing partnerships with major companies, we’re having a positive effect on more and more people each day.<br> <br>Calm is recommended by top psychologists, therapists, mental health experts, and the press:<br><br>* “I’m generally wary of meditation apps because they sometimes weave in too much mystic talk for my taste. But Calm instead contains guidance like ‘Concentrate on your body’” - New York Times<br><br>* “In the frenetic, crazy, digital world we live in, sometimes it&#39;s necessary to take a step back and smell the roses” - Mashable<br> <br>* “Eliminating distraction...ended up helping me relax and realize that all the stuff I was stressing about wasn&#39;t that big a deal” - Tech Republic",
    "scoreText": "4.5",
    "score": 4.4605174,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 16
  },
  {
    "title": "Buy'r",
    "appId": "com.buyr.app",
    "url": "https://play.google.com/store/apps/details?id=com.buyr.app",
    "icon": "https://play-lh.googleusercontent.com/zKQh33eY8WjkOjF3Os148ra7xA6ovF0SD4cbqeMck9gt7ypdMSF0jyGNRUm01ZDcsEER6eiMIIgcYVcC4jEDag",
    "developer": "Buy'r LLC",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Think you’re buying from a cool indie granola brand? Surprise—it’s owned by the same conglomerate that makes engine degreaser and (allegedly) sells your info to the CIA. Buy’r is your pocket-sized truth serum: scan any grocery product and see exactly who profits, from your local co-op to a megacorp with 19 shell companies and a yacht named Tax Haven.<br><br>While other apps rate your food or hand out “approved” badges, we don’t tell you what’s good or bad. We just show you the facts—who owns it, what’s in it, and how processed it is—so you can decide what fits your life, values, and oddly specific food rules.<br><br>Because real empowerment doesn’t come from a green checkmark—it comes from knowing the truth.<br><br>OUR MISSION:<br>We’re a small, self-funded team on a big mission: radical transparency in the grocery aisle. No corporate backing, no brand sponsorships—not even from the “cool” ones.<br><br>Whether you&#39;re avoiding shady corporate practices, trying to support real small businesses, or just tired of decoding labels that sound like marketing Mad Libs, Buy’r puts the power back in your hands—where it belongs.<br><br>DISCOVER THE TRUTH BEHIND EVERY PRODUCT:<br>Barcode Scanning - Point. Scan. Boom, instant dossier on the product, brand, and parent company. CIA-level info without the espionage.<br>Ownership Discovery - Find out if that &quot;small batch, artisanal vibe&quot; is real or just another product of a corporate rebrand strategy.<br>Brand &amp; Company Spotlights - Deep-dives that feel like true crime documentaries—but for shampoo and salad dressing.<br><br>SMART SHOPPING TOOLS:<br>Custom Ingredient Filters - Whether you&#39;re allergic to gluten or just emotionally allergic to corn syrup, filter it all. Presets, breakdowns, the works.<br>Shopping Lists with Full Integration - Build lists that actually sync with your pantry. No more accidental double-buying basil for the fifth time.<br>Pantry Manager - Take control of your pantry like the food hoarder CEO you were born to be. Recipes and meal planners are in development.<br>Receipt Scan Import - Snap a pic of your Kroger or Walmart receipt—get your pantry logged in faster than a teenager logging into TikTok.<br><br>NUTRITION &amp; TRANSPARENCY:<br>Detailed Nutrition Breakdown - We don’t just show calories—we show what those calories are hiding. Ultra-processed red flags, ingredient types, and what your food is actually made of (hint: it&#39;s not love).<br>Community Ratings &amp; Reviews - Because the hive mind can be smarter than the label. See what real people think—no bots, no BS.<br><br>EDUCATIONAL &amp; ENGAGING:<br>Interactive Quizzes - Think you know who owns your “indie” oat milk? Let’s test that brand loyalty.<br>Random Spotlight Carousel - A surprise-a-day from family-owned gems you probably missed while being hypnotized by mega-brand marketing.<br>31 Achievement Badges - Scan. Learn. Flex. Prove you’re not just a consumer—you’re a conscious one.<br><br>ALL FEATURES:<br><br>- Instant barcode scanning<br>- Ownership discovery &amp; brand family trees<br>- Deep-dive spotlights on companies (yes, even the shady ones)<br>- Ingredient filters with preset logic packs<br>- Smart, integrated shopping lists<br>- Pantry tracking with actual usefulness<br>- Receipt scanning from major grocers<br>- Transparent nutrition + processing breakdowns<br>- Community-powered reviews<br>- Corporate guessing games (a.k.a. quizzes)<br>- Indie brand discovery carousel<br>- 31 achievement badges for your consumer resume<br>- Randomized daily brand spotlights<br><br>SUBSCRIPTION OPTIONS:<br><br>Free Forever<br>Basic scans + product lookups<br>1 shopping list<br>20 pantry items<br>Lite spotlight access (just a taste)<br><br>Premium — $5/month or $50/year<br>Unlimited scans, lists, and pantry tracking<br>Full ingredient filtering<br>Full spotlight content<br>Receipt scanning<br>All quiz + discovery features<br>Feels like insider info—but legal!<br>( Search Keyword: Buyr )",
    "scoreText": "4.9",
    "score": 4.8541665,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 17
  },
  {
    "title": "Home Workout for Women",
    "appId": "swiftflyers.weightloss.workout.athome",
    "url": "https://play.google.com/store/apps/details?id=swiftflyers.weightloss.workout.athome",
    "icon": "https://play-lh.googleusercontent.com/k-GS94fHbrEJrrzFD6wPK5_fjFwjXUngN3nWqhRVJgAW5t0M_SzgiiwP4C0OIyw1Xw",
    "developer": "SWIFTFLYERS",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Get Ready for a Slimmer You—Your Ultimate Home Fitness Companion! 🔥<br><br>Transform your living room into a personal gym and discover a stronger, leaner, and fitter version of yourself with Home Workout for Women—the top-rated fitness app designed exclusively for women!<br><br>Why hit the gym when you can crush your fitness goals from the comfort of your home? Our app offers a treasure trove of home workouts tailored for busy lifestyles. Whether you’re looking to lose weight, tone up, or simply get moving, we’ve got you covered!<br><br>Quick &amp; Intense Home Workouts  <br>No more excuses! With our easy-to-follow routines, you can shed those extra pounds without ever leaving your house. Perfect for beginners and anyone who prefers a no-fuss workout, Slimmer You makes it simple to stay active and burn fat—even on your laziest days!<br><br>What’s Inside?<br>- Customizable Workout Planner: Tailor your sessions to fit your schedule and preferences. No equipment? No problem! Our planner includes exercises that target every muscle group, guiding you toward your fitness goals.<br>  <br>- Full Body Workouts: From fat-burning HIIT sessions to gentle stretching, our diverse categories cover everything: abs, legs, arms, and even butt workouts—no jumping required!<br><br>Amazing Features of Home Workout for Women:<br>💪 Workout Timer: Keep your sessions on track!  <br>💪 Video Tutorials: Follow along with ease!  <br>💪 Step-by-Step Instructions: Master each move safely!  <br>💪 Weight Loss Focus: Designed specifically for shedding pounds!  <br>💪 Coach Tips: Get insider advice for perfect form and maximum results!  <br>💪 Warm-Up &amp; Stretch Routines: Prepare and recover like a pro!  <br>💪 Calorie Tracker: Monitor your progress and stay motivated!  <br>💪 Suitable for Everyone: Whether you’re a newbie or a seasoned pro, we’ve got workouts for you!  <br>💪 Bodyweight Workouts: No gym, no problem!  <br>💪 Full Body Fitness: Comprehensive routines for all your needs!<br><br>Home Workout for Women is here to make your home workout experience fun, effective, and oh-so-convenient! With detailed instructions and helpful videos, you’ll feel confident and empowered as you tackle each exercise and watch your progress unfold. Who knew getting fit at home could be this enjoyable?<br><br>Disclaimer: This app is for informational purposes only and should not replace professional medical advice. Use it at your own risk. Always consult a healthcare professional before starting any new exercise program, especially if you have pre-existing health conditions. If you feel pain, dizziness, or discomfort during a workout, stop immediately. By using this app, you accept these terms.",
    "scoreText": "4.4",
    "score": 4.3627453,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 18
  },
  {
    "title": "Sweatcoin・Walking Step Counter",
    "appId": "in.sweatco.app",
    "url": "https://play.google.com/store/apps/details?id=in.sweatco.app",
    "icon": "https://play-lh.googleusercontent.com/ilCzgxgHDfjc89NiP2znisFCIOWi9TsDlBzzKGZNP_zynsveO1YsjDTphhdIbKWd5c5Z",
    "developer": "Sweatco Ltd",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Step up your fitness game with Sweatcoin!<br><br>Looking for a fun way to boost your fitness &amp; get rewarded? Sweatcoin, the viral walking app is here to transform your steps into real-world rewards! Earn Sweatcoins with every step you take and redeem them for exclusive gadgets, sports gear, and amazing experiences in our marketplace! You can even donate your sweatcoin to good cause and make a difference.<br><br>The more you walk, the more earn! And the more you earn, the more you walk! <br><br><br>Discover the benefits:<br><br>- Effortless step tracking: Sweatcoin’s pedometer runs smoothly in the background, tracking your steps accurately without draining your battery. It’s your perfect fitness companion, whether you’re walking, running, or working out at home.<br><br>- Unlock rewards: Use your sweatcoins to access incredible offers and discounts that you won’t find anywhere else. Your fitness journey has never been so rewarding!<br><br>- Get moving, get badges: Hit your daily step goals and collect unique badges for each milestone achieved.<br><br>- Calling all streak masters: Compete with friends to see who can maintain the longest step streak. Fitness is more fun with a little friendly competition!<br><br><br>Features<br><br>Privacy first: We use a secure, proprietary algorithm to count your steps. Your location and personal data stay private—only you have access to your information.<br>Pedometer: Accurate step tracking with minimal battery usage.<br>Device compatibility: Available on Android and iOS devices. Apple Watch users can also enjoy Sweatcoin. Android Wear compatibility is on the way!",
    "scoreText": "4.1",
    "score": 4.1471863,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 19
  },
  {
    "title": "7 Minute Workout",
    "appId": "com.loseweight.seven.minute.workout",
    "url": "https://play.google.com/store/apps/details?id=com.loseweight.seven.minute.workout",
    "icon": "https://play-lh.googleusercontent.com/_IGIOFiedTqswqDHHKGTE9RwxanGcjhZ5VeM6rXK42Sr9E08pKiKs8MLbxY6TD6SDPk",
    "developer": "Atomobi",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "If you want to lose weight, have a flat belly and a perfect body, use our 7 Minute Workout, which will help you tone your abs, with video explanations for each move.<br><br>7 Minute Workout will be the suitable software for ordinary people to exercise! You can exercise anytime, anywhere, it only takes 7 minutes! You can use it to exercise your major muscles and keep fit safely, effectively and efficiently. Try the 7 Minute Workout App to make you healthier!<br><br>Why choose 7 Minute Workout?<br><br>· Exercise anytime, anywhere, no equipment required<br><br>· Daily exercise challenges help you develop good exercise habits<br><br>· Compete with friends to gain more encouragement and support<br><br>· Earn achievements as you level up from novice to athlete level<br><br>· Personal workouts tailored to individual needs and preferences<br><br>· 3D character demonstration makes it easier to master the essentials of actions<br><br>You only need to spend 7 minutes every day, and then you can regulate your body and strengthen your body.",
    "scoreText": "3.9",
    "score": 3.93,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_free",
    "rank": 20
  },
  {
    "title": "Pupil Distance PD Glasses & VR",
    "appId": "techpositive.glassifyme",
    "url": "https://play.google.com/store/apps/details?id=techpositive.glassifyme",
    "icon": "https://play-lh.googleusercontent.com/h-tYLMHDwdD9NIdL2enIQH_gxFHM9f6OfXELS5k_SePlfsGoSgoXS1UZzM3OeqHPTDQ",
    "developer": "Tech+Beyond",
    "currency": "USD",
    "price": 5.99,
    "free": false,
    "summary": "<b>#1 Top Ranked App for measuring Pupillary Distance also known as PD.</b><br><br>PD Meter App by GlassifyMe is the perfect tool to measure your Pupillary Distance (PD) quickly and accurately. Simply take a picture holding a standard sized card with the magnetic strip facing the camera and let us do the rest.<br><br><b>Note:</b> Using a credit card is NOT required, nor recommended. Please use a points or rewards card. The card is only used for the purpose of reference sizing.<br><br><br><b> What is PD?</b><br>PD, short for Pupillary Distance, is the distance between the center of your pupils in millimeters. This measurement is important during the manufacturing of your prescription glasses to ensure you get proper vision. This measurement is also needed for your VR (Virtual Reality) headsets.<br><br><br><b>Why PD Meter App?</b><br>• Measure your Distance and Reading PD in 3 quick steps<br>• Automatically detects your eyes and pupils<br>• Advanced algorithm that calculates and gives precise results<br>• Take a selfie, ask a friend to take your picture, or import photo from gallery.<br><br>** Watch the full video tutorial at https://youtu.be/eIuSNoEZWig",
    "scoreText": "4.7",
    "score": 4.74,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 1
  },
  {
    "title": "White Noise",
    "appId": "com.tmsoft.whitenoise.full",
    "url": "https://play.google.com/store/apps/details?id=com.tmsoft.whitenoise.full",
    "icon": "https://play-lh.googleusercontent.com/S0f5TYewViN6fSjVhq4S5vJThfZzNMJKql3TX9Z4hgRkHlrZ1a-PlY5Gig_axeiFUA0",
    "developer": "TMSOFT",
    "currency": "USD",
    "price": 0.99,
    "free": false,
    "summary": "Recommended as a miracle for better sleep! Find out why the world is sleeping better with White Noise. Features ambient sounds of the environment to help you relax during the day and sleep great at night.<br><br>Do you have trouble going to sleep? Are you traveling on a plane and need a quick power nap? Does your newborn baby wake up in the middle of the night? There are numerous benefits to using White Noise:<br><br>• Helps you sleep by blocking distractions<br>• Relaxes and reduces stress<br>• Pacifies fussy and crying babies<br>• Increases focus while enhancing privacy<br>• Soothes headaches and migraines<br>• Masks tinnitus (ringing of the ears)<br><br>Even when you’re asleep, your brain is constantly scanning and listening for sounds. If it’s too quiet, unwanted noises such as faucet drips or police sirens can interrupt your sleep. White Noise generates sounds over a wide range of frequencies, masking those noise interruptions, so you can not only fall asleep, but stay asleep.<br><br>SOUND CATALOG<br><br>40 sounds are included as part of the application (no downloading required unless you want more) including all the color noises (brown, white, pink, etc), mechanical sounds like a bedroom fan or air conditioner, light to heavy rains, rushing water sounds, beach and ocean waves, and so much more. For the entire list of sounds please visit our website. No streaming is required for playback.<br><br>APPLICATION FEATURES<br>• 40+ perfectly looped sounds with additional free sounds from the White Noise Market at https://whitenoisemarket.com/<br>• Record and loop new sounds with total ease<br>• Background audio support so you can use other apps while listening<br>• App Widget and Chromecast TV support for audio control and playback. (Note: Chromecast audio devices require using the Google Home app)<br>• Create new soundscapes by mixing multiple noises together with support for adjusting volume, balance, and pitch of each individual sound in the mix.<br>• Full screen digital clock with multiple colors and brightness controls makes it the perfect companion for any nightstand<br>• Advanced alarm and timer system that slowly fades audio in and out so you awake naturally feeling more refreshed<br>• On-screen media player and volume controls with swipe gesture support for navigating sound collection<br>• Star favorite sounds and mixes in the sound catalog for quick access using the Favorite view<br>• Designed to work on all Android-based phones and tablets<br>• Advanced Settings let you prevent interruptions such as notifications, tweak buffer size for optimal playback, adjust sound volume, balance, pitch, custom alarm snooze times, and more. All the pro tools and settings you need for better sleep.<br>• No Advertising<br><br>PRESS REVIEWS<br><br>White Noise has been featured by numerous publications and media outlets including Consumer Reports, Today Show, The Dr. Oz Show, Fox &amp; Friends First, Time, The Washington Post, Health Magazine, NY Times, Macworld, PC Magazine, PC World, CNET, Esquire, and Late Night with Jimmy Fallon show.<br><br>PERMISSIONS EXPLAINED:<br><br>WAKE_LOCK / DISABLE_KEYGUARD: Alarms unlock and wake the device<br>WRITE_EXTERNAL_STORAGE: Downloaded and exported sounds are written to external storage<br>RECORD_AUDIO / MICROPHONE: Create and loop new recordings<br>CAMERA: Assign photo to your recordings. Camera is not used for anything else.<br>LOCATION / READ_GSERVICES: Geo Tag your new recording. Location is not used for anything else.",
    "scoreText": "4.5",
    "score": 4.4960785,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 2
  },
  {
    "title": "QZ (qdomyos-zwift)",
    "appId": "org.cagnulen.qdomyoszwift",
    "url": "https://play.google.com/store/apps/details?id=org.cagnulen.qdomyoszwift",
    "icon": "https://play-lh.googleusercontent.com/rRmQtSYwRuxyQvBKY_nzZjZ1xPohFCs9oz_DU4Z9ev28jvBchs8-p5BpfRYqoEgypA",
    "developer": "Roberto Viola - Cagnulein",
    "currency": "USD",
    "price": 7.99,
    "free": false,
    "summary": "** QZ is not affiliated with or endorsed by any subscription service or maker of exercise equipment. **<br><br>Have you got a Domyos (Decathlon), Echelon,Proform,Flywheel,Yesoul,Toorx treadmill or bike and you want to join to zwift? This app allows you to give a second life to your machine!<br><br>Also with Peloton you can have auto following workout (it will change resistance for you!)<br><br>Simply connect your smartphone to the treadmill/bike and zwift will recognize it!<br><br>Also with Strava Autopload feature!<br><br>Finally it supports Wear OS ! Download also the app on your watch! It will read the HR and it will send it to the QZ main app!<br><br>Compatibility list:<br>- all the Echelon bikes<br>- all the Domyos bikes<br>- all the Domyos treadmills<br>- all the Domyos elliptical machinery<br>- Keiser M3i without converter!<br>- Yesoul S1, S3 (M3 needs a cadence sensor)<br>- Sportstech bikes<br>- Inspire bikes<br>- Schwinn IC4 and Bowflex C6<br>- Toorx bikes and spinbikes<br>- Fassi treadmills<br>- all the Proform bikes<br>- Proform treadmills (i need confirmation about this)<br>- Flywheel bike (the calibration tool is here https://ptx2.net/apps/flytest/ )<br>- JK Fitness treadmill<br>- Toorx treadmills",
    "scoreText": "4.7",
    "score": 4.72,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 3
  },
  {
    "title": "Couch to 5K®",
    "appId": "com.active.aps.c25k",
    "url": "https://play.google.com/store/apps/details?id=com.active.aps.c25k",
    "icon": "https://play-lh.googleusercontent.com/LHKVqpiaLMXDX4r05WYV0IKZc1sphtp81Io4tCO0ENgaOFYEdW9UHupiseYbM95wR-s",
    "developer": "ACTIVE Network, LLC",
    "currency": "USD",
    "price": 4.99,
    "free": false,
    "summary": "Get off the couch and get running with the OFFICIAL Couch to 5K® training app! This oft-imitated program has helped thousands of new runners move from the couch to the finish line. Spend just 20 to 30 minutes, three times a week, for nine weeks, and you’ll be ready to finish your first 5K (3.1-mile) race!<br><br>WINNER of the 2012 Appy Award for best Healthcare &amp; Fitness App!<br><br>Features<br>✓Training plan designed by Active.com trainers<br>✓Choose from 4 different motivating virtual coaches—Johnny Dead, Constance, Billie or Sergeant Block<br>✓Hear human audio cues to guide you through each workout<br>✓Listen to your favorite playlists with in-app music player<br>✓Calculate your distance &amp; pace and map your routes with FREE GPS support<br>✓Log your workouts and share your progress on Facebook <br>✓Get support from the largest running community on Active.com Trainer<br>✓Repeat workouts and track your best performance<br>✓Treadmill support allows manual entry of workouts<br>✓Track your progress with total distance and average pace<br>✓Graphs for workouts to compare distance and pace<br><br>Finished the Couch to 5K program and ready to take your running program to the next level? Check out our 5K to 10K app to prep for your first 10K race here https://play.google.com/store/apps/details?id=com.active.aps.tenk!<br><br>Praise<br>&quot;The popular Couch to 5K app helps new runners avoid injury from doing too much, too soon.&quot;<br>—Runners World, June 2012<br><br>&quot;It&#39;s ridiculously easy to use (it&#39;s hard not to, as you just do what you&#39;re told) and it&#39;s fantastic that you have an encouraging voice talking you through things.&quot;<br>—Engadget, June 2012<br><br>&quot;Active.com’s Couch to 5K is one of my favorite… apps. With its customizable features, interactivity, and well-rounded interface, I may actually stay off the couch this time.&quot;<br>—148Apps, October 2011<br><br>&quot;I knew as soon as I decided to start the Couch to 5K program that I would need something to keep me accountable—not just to showing up for my training, but to actually doing it properly. Of course there’s an app for that.&quot;<br>—CalorieLab, April 2012<br><br>&quot;If you have been struggling to get your buns off the couch and somewhat in shape before the summer hits, training for a 5K is not a bad way to start. If you are looking for a program to help get you there, then the “Couch to 5K” running plan by CoolRunning is probably your best bet if you haven’t done an ounce of athletic activity for a number of years.&quot;<br>—Droid Life, April 2012<br><br>Get more information about the Couch to 5K app here: http://www.active.com/mobile/couch-to-5k-app<br><br>Notes<br>• Once you purchase the app, it is yours to keep. It does not expire after 9 weeks.<br><br>For additional support please contact us at: MobileSupport@activenetwork.com. We would love to hear from you.<br><br>THIS APP AND ANY INFORMATION GIVEN BY IT OR THE ACTIVE NETWORK, LLC, ARE FOR INFORMATIONAL PURPOSES ONLY. THEY ARE NOT INTENDED NOR IMPLIED TO BE A SUBSTITUTE FOR PROFESSIONAL MEDICAL ADVICE. YOU SHOULD ALWAYS CONSULT YOUR HEALTHCARE PROVIDER BEFORE BEGINNING ANY FITNESS PROGRAM. IN PARTICULAR, THE ACTIVITIES AND EXERCISES DESCRIBED IN TRAINING PROGRAMS AND ARTICLES ON ACTIVE CAN BE DANGEROUS AND MAY RESULT IN INJURY OR DEATH. YOU MUST CONSULT WITH A LICENSED PHYSICIAN BEFORE PARTICIPATING IN ANY OF THE ACTIVITIES DESCRIBED IN THE APPLICATION.",
    "scoreText": "4.5",
    "score": 4.4954953,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 4
  },
  {
    "title": "Pupil Distance PD Meter Pro",
    "appId": "com.vistechprojects.pupildistancemeterpro",
    "url": "https://play.google.com/store/apps/details?id=com.vistechprojects.pupildistancemeterpro",
    "icon": "https://play-lh.googleusercontent.com/QF4yfhQubY1h16t22ZP0BD2L2g8XNIbyqZUYWPvvB_yy6kuw_h_rV0-rfJ4SYSGJHg",
    "developer": "vistech.projects",
    "currency": "USD",
    "price": 3.99,
    "free": false,
    "summary": "The best mobile solution for pupillary distance (PD) measurement with a camera.<br> 👓 Try-On basic eyeglass frames bonus <br><br>🆓 Check your interpupillary distance (IPD) before buying eye or sunglasses, or VR headset <br><br>If you have any questions, requests, or need assistance with the app, please contact support@vistechprojects.com. <br><br>If you have any issues with the app on your device we will address them as soon as you contact us or will give your a refund if you want to cancel your order for any reason.<br><br>👍 Unlike many other apps, we don&#39;t follow the competition trends of unfair play, WE DO NOT BUY FAKE REVIEWS to promote our apps, all positive reviews of our apps are organic and from real users.  Hopefully, the negative ones are also from real users, though many of them never follow up on our offer to help or resolve the issues.<br>Thank you for your interest and enjoy the app!",
    "scoreText": "3.7",
    "score": 3.67,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 5
  },
  {
    "title": "The Blood Type Diet®",
    "appId": "com.northamericanpharmacal.btd",
    "url": "https://play.google.com/store/apps/details?id=com.northamericanpharmacal.btd",
    "icon": "https://play-lh.googleusercontent.com/iQbvwrVX2uFjYhTPH0Ga_eg8a6VVwQyoNNrTk5VIi_pCA_lXsCRzpYTQz0cucxjjybg",
    "developer": "North American Pharmacal, Inc.",
    "currency": "USD",
    "price": 3.99,
    "free": false,
    "summary": "Dr. Peter J. D&#39;Adamo&#39;s Blood Type Diet® App for Android phones and tablets lists Beneficial, Neutral, and Avoid foods for each of the 4 blood types. It also includes Unknown for those foods not determined.<br>Handy for grocery shopping, eating in restaurants, and meal planning. On the go or at home, you can always be sure that you are eating right for your type.<br>Easy to use. Just select your blood type and start picking foods for your type categorized in the handy Food List. Know your secretor status? There&#39;s an option in the app to set secretor status — or how to learn more.<br><br>Ours is the only officially approved Blood Type Diet® App for the Android. It&#39;s a great way to keep the Blood Type Diet® at your fingertips - a quick, concise and easy reference.<br><br>Includes:<br>Blood Type and optional Secretor Status selection<br>Food Lists<br>Shopping List - choose your own or combine family list for multiple blood types<br>Email Shopping List directly from the app<br>Family Food List - combine common foods for multiple blood types<br>Information about each Blood Type<br>User Guide<br>Frequently Asked Questions (FAQ)<br>Food Search<br>Intuitive icons for easier identification and navigation<br>Convenient Recipe Access (Note: Internet connection required)<br>Dietary Supplement Information with A to Z supplement link<br>Improved the app screens, making better use of how they display on larger devices<br><br>You can view the screenshots shown above for a a helpful sample of what you get.<br> <br>We do support our app and encourage you to report a problem, ask a question - or maybe just share your feedback (see More, then Feedback or email appsupport@dadamo.com). The app is license protected so be sure you have connectivity for successful access.<br><br>We appreciate your interest in Dr. Peter J. D&#39;Adamo&#39;s Blood Type Diet®.",
    "scoreText": "4.5",
    "score": 4.5,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 6
  },
  {
    "title": "FitNotes Supporter",
    "appId": "com.fitnotesapp.fitnotessupporter",
    "url": "https://play.google.com/store/apps/details?id=com.fitnotesapp.fitnotessupporter",
    "icon": "https://play-lh.googleusercontent.com/8YQ-cOJHjF5ofYqAHv2fwkPkJaSo8yqLVbqbVEHDRsHX1T2os1G8QnPXa5nMjj5r7bg",
    "developer": "James Gay",
    "currency": "USD",
    "price": 6.99,
    "free": false,
    "summary": "If FitNotes has become an invaluable aid to your training and you would like to show your support for its continued development then you are now able to do so by becoming a FitNotes Supporter.",
    "scoreText": "4.9",
    "score": 4.92,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 7
  },
  {
    "title": "Seconds Pro - Interval Timer",
    "appId": "com.runloop.seconds",
    "url": "https://play.google.com/store/apps/details?id=com.runloop.seconds",
    "icon": "https://play-lh.googleusercontent.com/2faw_FCk98md2pOG-lSeuUFnIw0gG6faxrdUdpx9jJkVLMgs9_QVdblZMYbjMVZIoOG-",
    "developer": "Runloop",
    "currency": "USD",
    "price": 6.99,
    "free": false,
    "summary": "LOOK NO FURTHER, Seconds Pro Interval Timer is the most advanced interval training timer available for mobile. Seconds has been downloaded over 2 million times, and has over 7000 5-star reviews. Other interval timers don&#39;t even come close when it comes to quality, features and ease of use.<br><br>SECONDS PRO AT A GLANCE:-<br><br>• Large clear timer display<br>• Templates for HIIT, Tabata, Circuit Training and more<br>• Custom timers to create any intervals imaginable<br>• Speaks your interval names<br>• Loud or soothing alerts<br>• Coordinate music with intervals<br>• Share or import timers<br>• Runs in the background<br><br>MORE INFORMATION:-<br><br>• LARGE CLEAR TIMER DISPLAY AND COLOUR CODING<br>The timing screen has a large, clear, time display that can easily be read from a distance. It works in portrait or landscape. The current interval and next interval are displayed so you can see also what&#39;s up now and next. The entire background uses the current interval colour so you don&#39;t even need to read the name.<br><br>• TEMPLATES MAKE IT EASY TO PROGRAM<br>Seconds comes with templates for High Intensity Interval Training (HIIT), Tabata and Circuit Training making it very easy to quickly create a timer for your workouts. If you require more advanced options, Seconds Interval Timer doesn&#39;t let you down. You can create completely custom timers one interval at a time, or even combine timers together to create compound timers.<br><br>• TEXT TO SPEECH AND ALERTS<br>The text to speech option will speak your interval names as you get to them, or even give you some advance warning. Alternatively, you can choose from the built in alerts. These ranges from simple beeps, to MMA air horns and boxing bells, to bells and gongs for more relaxing timers.<br><br>• MUSIC INTEGRATION<br>Seconds allows you to match the intensity of your music to the intensity of your workout. For each interval, you can select a song, album, artist or playlist. If this is not to your taste you can simply play another music source in the background.<br><br>• SHARE YOUR TIMERS WITH FRIENDS<br>Share the interval timers you’ve created with your friends either via our companion website (http://www.intervaltimer.com) or via email attachment<br><br>• SAMPLE TIMERS<br>Seconds comes with a host of pre-made timers in the timer repository.",
    "scoreText": "4.2",
    "score": 4.2272725,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 8
  },
  {
    "title": "Brain Waves Pro Binaural Beats",
    "appId": "com.myniotech.brainwavespro",
    "url": "https://play.google.com/store/apps/details?id=com.myniotech.brainwavespro",
    "icon": "https://play-lh.googleusercontent.com/GI9drAMKMGoHziGiQDP67_5TfxjhVrTd_zonxhASoBULB8DK6e4Worh1ohuOKgzjbPI",
    "developer": "MynioTech Apps",
    "currency": "USD",
    "price": 1.99,
    "free": false,
    "summary": "With this app you can easily generate pure waves that will stimulate your concentration, meditation or relaxation. <br><br><br><b><i>Very Important</i></b> <br><b> • Use headphones for a better sound experience <br><br>• Don&#39;t use this app while driving or operating heavy machinery.<br><br>• Take care of your hearing, is not necessary to hear these sounds at high volume.</b><br><br><br>You can generate and save your own frequencies using two independent oscillators, controlled by two horizontal bars, with fine adjust buttons or directly by input the desired value you want (tap the left or right frequency value to open the input dialog).<br>You can use values with two decimal points (eg 125.65).<br><br>The sounds are produced in real time, they are not pre-recorded sounds. This enables to play them without interruption as long you want.<br><br><b>How it works</b><br>Binaural beats, or binaural tones, are auditory processing artifacts, or apparent sounds, caused by specific physical stimuli.<br>This effect was discovered in 1839 by Heinrich Wilhelm Dove and earned greater public awareness in the late 20th century based on claims coming from the alternative medicine community that binaural beats could help induce relaxation, meditation, creativity and other desirable mental states.<br><br>The effect on the brainwaves depends on the difference in frequencies of each tone: for example, if 300 Hz was played in one ear and 310 in the other, then the binaural beat would have a frequency of 10 Hz.<br><br>To experience the binaural beats perception, it is best to listen to this file with headphones on moderate to weak volume – the sound should be easily heard, but not loud. Note that the sound appears to pulsate only when heard through both earphones. <br>For more info visit: https://en.wikipedia.org/wiki/Binaural_beats <br><br><b>Important</b><br><br>For best results please use headphones.<br>Take care of your hearing, is not necessary to hear these sounds at high volume.<br>The bottom slide bar controls the volume, but it is independent of your device&#39;s volume, so if there is no sound or it&#39;s too high, also set your device&#39;s volume to balance the sound. <br><br><b>Also Important</b><br>Latest Android versions, are evolving to manage system recourses and automatically slow down the cpu usage for optimize resources.<br>The real time audio synthesis, like we use in our apps is a very sensitive process when the OS is trying to stop or decrease cpu usage for this main thread.<br><br>If you have some issue playing the audio, please follow the instructions in this link: <br><br>https://dontkillmyapp.com<br><br><b>Manage Presets</b><br><br>You can save a preset directly from the main screen by clicking on the top button &quot;Tap to Save&quot;, the current values are loaded automatically to the next screen.<br>Then just type a name and click Save. <br><br>To load a preset, click on Presets in the main screen and then choose a preset by clicking on its name. <br><br>To delete a preset simply click on the trashcan button. <br><br><b>Running in background</b><br>To let the app running in the background, just press the &quot;Home&quot; button on your device.<br>If you press the \\&quot;Back\\&quot; button the app will close. <br><br><b>Timer</b><br>Just type a value in minutes. The app will shutdown automatically when the time ends.<br><br><b>Wave Types</b><br><br><b>Theta</b><br>Meditation<br>Intuition<br>Memory<br><br><br><b>Delta</b><br>Healing<br>Deep Sleep<br>Detached Awareness<br><br><b>Alpha - </b><br>Relaxation<br>Visualization<br>Creativity<br>Sleep <br><br><br><b>Theta</b><br>Meditation<br>Intuition<br>Memory<br><br><br><b>Gamma</b><br>Inspiration<br>Higher Learning<br>Focus<br><br><b>Beta</b><br>Alertness<br>Concentration<br>Cognition<br><br><br><b>Main features</b>:<br><br>- Meditation helper;<br>- Concentration to study;<br>- Relaxing Sounds;<br>- Help to fall asleep;<br>- Noise Block;<br>- Anti-stress;<br>- It will provide continuous sounds, generate binaural beats in real time, no loops;<br>- Works in background, just press the &quot;Home&quot; button or use in app shortcut;",
    "scoreText": "4.5",
    "score": 4.5,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 9
  },
  {
    "title": "Body Temperature Pro",
    "appId": "com.spwatches.bodytemperaturepro",
    "url": "https://play.google.com/store/apps/details?id=com.spwatches.bodytemperaturepro",
    "icon": "https://play-lh.googleusercontent.com/CbGk9ZtWxDo1ve0BKZ_g8ujPlvb9LMZlcoUqL61hb4cUfv1y3jP3M-sA6xHTRLJXiA",
    "developer": "SP Watches",
    "currency": "USD",
    "price": 0.99,
    "free": false,
    "summary": "Accurate Wrist &amp; Ambient Temperature Readings on Your Galaxy Watch<br><b>Supports: Galaxy Watch 5, 6, 7, 8 including Ultra (Wear OS)</b><br><br>Looking for a real temperature app for your Galaxy Watch?<br>Unlike other apps that show fake or simulated data, Body Temperature Pro uses your watch’s built-in sensor to measure actual wrist and surrounding temperatures — with improved accuracy, easy calibration, and temperature history tracking.<br><br><b>🔥 Why This App?</b><br><br>✅ Real sensor-based temperature readings<br>✅ Official Samsung Health Member<br>✅ Trusted by thousands of Wear OS users<br>✅ Continuously updated with new features<br><br><b>🌡️ New Features in 2025</b><br>* 🧪 Calibrator Tool – Adjust readings to match external thermometers<br>* 📊 Temperature History Viewer – See all past Wrist, Body, and Ambient readings in the Companion App<br><br><b>🧠 How to Use It Effectively</b><br><br>✅ Wrist Temperature<br>* Ensure the watch is snug on your wrist<br>* Avoid direct sunlight or external heat<br>* Take 3–4 readings for consistent results<br>* Note: The sensor sits near the watch’s metal body, which may affect values slightly<br><br>✅ Surrounding Temperature<br>* Remove the watch for 5 minutes before testing<br>* Avoid placing it on warm surfaces<br>* Take multiple readings for higher accuracy<br><br>⚠️ Body Temperature (Experimental)<br><br>Galaxy Watches do not support true body temp measurement. This feature is provided for experimental use only. Please do not use it for health diagnosis or decisions.<br><br><b>🔧 Calibrator Tool – Fine-Tune Your Temperature Readings</b><br><br>Noticed that your temperature readings feel a bit off? You can easily adjust them using our built-in Calibrator Tool.<br><br>If you believe your wrist temperature is off by +2°C, simply enter 2 in the Calibrator and save. The next time you take a measurement, the app will automatically add 2°C to the value received from your watch’s sensor.<br><br>This helps personalize your experience and bring readings closer to real-world values — especially since sensor-based temperature readings can vary slightly depending on factors like body type, skin contact, and watch placement.<br><br>✅ Works for Wrist, Surrounding, and Experimental Body Temperature<br>✅ Supports both positive (+) and negative (−) offsets<br>✅ Calibration is saved automatically for all future readings<br><br>💡 Use a trusted thermometer to compare and find the best offset for you!<br><br><b>📱 Key Features</b><br><br>*📍 Accurate Wrist Temperature<br>* 🌬️ Surrounding Temperature Mode<br>* 🧪 Experimental Body Temperature<br>* 🌡️ Celsius &amp; Fahrenheit shown together<br>* 🔁 Wear OS Tiles for one-tap measurement<br>(Tap arrow to refresh with latest data)<br>* 📎 Complications Support (C/F)<br>* 🎯 Easy, user-friendly interface<br>* ✨ Beautiful UI animations<br>* 🔧 Calibrator Tool for better accuracy<br>* 🕘 Temperature History (Mobile Companion App)<br><br>🚀 Installation Instructions<br>1.\tConnect your Galaxy Watch to Wi-Fi<br>2.\tOpen the Play Store app on your watch<br>3.\tSearch for “Body Temperature Pro” and install directly on the watch<br><br>Still having trouble? Just email us at: spapps2023@gmail.com<br><br>❓ Think Readings Are Inaccurate?<br><br>We rely on data directly from the official temperature sensor in your watch. However, if readings feel off:<br>* Use the built-in Calibrator Tool<br>* Or email us at spapps2023@gmail.com with screenshots or evidence<br>(Your feedback helps improve the app for everyone!)<br><br>⚠️ Note: Temperature sensing on smartwatches is still evolving. While we do our best with software enhancements, results may vary based on environment and usage.",
    "scoreText": "3.1",
    "score": 3.106383,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 10
  },
  {
    "title": "Bar Is Loaded 2 - Gym Math",
    "appId": "com.dongledan.barisloaded2",
    "url": "https://play.google.com/store/apps/details?id=com.dongledan.barisloaded2",
    "icon": "https://play-lh.googleusercontent.com/acuC4BfFfzcjhhiuWXkVMBeTOBTu5GS5Bhm_BsPZe20OWPSJyYtLqhQevk2n_-QuPw",
    "developer": "dongledan",
    "currency": "USD",
    "price": 1.99,
    "free": false,
    "summary": "Update to the popular app to handle newer Android versions and a smoother experience, checkout the original: https://play.google.com/store/apps/details?id=com.dongledan.barisloaded<br><br>Give your brain a break with *Bar Is Loaded*, the ultimate plate loading calculator! Whether you&#39;re prepping for leg day or a meet, this easy-to-use app helps you quickly figure out how many plates to load on the bar. Plus, it comes packed with powerlifting calculators like Wilks score, RPE, and more—all in one app! <br><br>### Features include:<br><br>**Home:**<br>- Easy KG or LB plate loading calculations<br>- Customize your inventory (barbell, collars, and plates available)<br>- Ability to toggle between bumper plates<br>- Percent table calculations<br>- Reverse calculator for quick adjustments<br>- Display both KG &amp; LB plates<br>- Simple KG or LB inputs<br><br>**Meet Prep:**<br>- Sticking point help with direct links to short, helpful videos<br>- Gear suggestions for the gym!<br>- Attempt selections for meet day strategy<br><br>**Powerlifting Calculators:**<br>- Wilks, IPF Points, and DOTS calculator<br>- Sinclair or Q-Points for our weightlifting friends<br>- RPE Calculator<br>- 1-10 rep max calculator (ideal for training maxes)<br><br>Use BARISLOADED for 10% off at https://whitetoelifting.co/!<br> Use BARISLOADED for 20% off at https:/blackmagicsupps.com/!<br><br>Got suggestions or issues? Contact me at dongledan@yahoo.com or reach out to @barisloadedapp on instagram. This app is made for all you swole users out there!<br><br>Perfect for gym-goers, with powerlifters in mind. Quick math, made easy.",
    "scoreText": "4.7",
    "score": 4.714286,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 11
  },
  {
    "title": "HRV4Training",
    "appId": "com.asma.hrv4training",
    "url": "https://play.google.com/store/apps/details?id=com.asma.hrv4training",
    "icon": "https://play-lh.googleusercontent.com/Nh9YzGpwRS02H5PHKL7u2TrvhYqxElC3rHcxk-SodSGAfYqQdNHHMvTlu5FX1sXMEA",
    "developer": "A.S.M.A. B.V.",
    "currency": "USD",
    "price": 11.99,
    "free": false,
    "summary": "The only scientifically validated HRV app that doesn&#39;t require an external sensor. HRV4Training helps you optimize your goals by providing tailored feedback on your physical condition<br><br>On compatibility with your phone: the app will detect right away if your phone is supported so that you can always get a refund in case it is not. <br><br>HRV4Training in addition to our camera based measurements, supports the Oura ring, Coros watches and Bluetooth sensors (e.g. a Polar chest strap, our recommendation)<br><br>HRV4Training is also the first app that goes beyond simple measurements and provides insights on:<br>1) acute or day to day HRV changes in response to different stressors (alcohol, travel, sick days, training, menstruation, etc.) <br>2) long term multi-parameter trends to look at the big picture <br>3) correlations between physiological measurements and annotations <br>4) training load analysis, fitness, fatigue, readiness to perform and injury risk <br>5) VO2max estimation for runners linking the app to Strava or TrainingPeaks <br>6) Training Polarization analysis<br>7) Weekly and monthly summaries to track progress. <br><br>All data is processed inside the app in order to provide you with actionable interpretations that can help optimizing your training plan and performance.<br><br>Other features: <br>- HRV-based advice helps you to adapt your trainings based on objective measures of recovery<br>- TAGS: lets you tag your sleep, mental energy, muscle fatigue, stress and all other parameters that can help you understand what is influencing your physical condition and physiological stress<br>- Works with Bluetooth SMART heart rate monitors (a Polar H7 is recommended) <br>- Configurable test (choose test duration between 1, 3 or 5 minutes)<br>- Shows the PPG signal view to ensure signal quality during the test if the camera is used instead of a sensor<br>- Extracts and stores the following features while lying down and/or standing: heart rate, mean of beat-to-beat intervals (AVNN), standard deviation of beat-to-beat intervals (SDNN), square root of the mean squared difference of successive R-Rs (rMSSD), number of pairs of successive R-Rs that differ by more than 50 ms (pNN50), low frequency power (LF, 0.04-0.15 Hz), high frequency power (HF, 0.15-0.40 Hz)<br>- Population summaries and people like you comparisons to put your data into perspective<br>- Data export via email <br>- RR-intervals correction<br>- Integrates with TrainingPeaks, Strava and others<br><br>More details on HRV and app usage are available here: <br>http://www.hrv4training.com/quickstart-guide.html<br><br>and here: https://marcoaltini.substack.com/ <br><br>HRV4Training requires to register an account with your email address, so that your data can be backed up safely and retrieved in case anything happens (app issue, changing phone, etc.).",
    "scoreText": "3.3",
    "score": 3.28,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 12
  },
  {
    "title": "Mind Monitor",
    "appId": "com.sonicPenguins.museMonitor",
    "url": "https://play.google.com/store/apps/details?id=com.sonicPenguins.museMonitor",
    "icon": "https://play-lh.googleusercontent.com/hd1dmXlCGSME_giBk3LndNBYPUnWivNeqPNic7Ga-ShyM6PQkgBsjGG1GMEh0RdQBMk",
    "developer": "James Clutterbuck",
    "currency": "USD",
    "price": 14.99,
    "free": false,
    "summary": "See what&#39;s really going on inside your head in real time!<br><br>Mind Monitor is exclusively for use with &quot;Muse: The Brain-Sensing Headband&quot; from Interaxon (available at http://choosemuse.com)<br><br>Get real time EEG brainwave data beautifully graphed, right on your phone or tablet.<br><br>* Professional grade spectrogram<br>* Discrete frequency breakdown<br>* Raw microvolts<br>* Absolute wave values<br>* Gyroscope<br>* Accelerometer<br><br>Graph your recordings online at https://Mind-Monitor.com<br><br>Split data by channel, into left brain/right brain, Front/Back, or even individual sensors.<br><br>Record EEG data to Excel compatible CSV file format, or Muse Protocol Buffer format, for playback in Muse Player.<br><br>OSC Streaming for wireless data monitoring/recording with compatible software such as the free Interaxon Muse Lab.<br><br>Share images with your friends.<br><br>* This app is not affiliated in any way with Interaxon; but I want to give a big shout out to everyone at the company for such an amazing product and to the team who supported the development of this app.",
    "scoreText": "4.4",
    "score": 4.44,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 13
  },
  {
    "title": "Sobriety Counter -EasyQuit pro",
    "appId": "com.herzberg.easyquitsdrinkingPro",
    "url": "https://play.google.com/store/apps/details?id=com.herzberg.easyquitsdrinkingPro",
    "icon": "https://play-lh.googleusercontent.com/0y6t4TEuOlxBFzIQO8SZSEY2iigW9z2E3JxF1mt6sJcdmQImHdjW3C5vPEINpb4mMw",
    "developer": "Easy Health Apps",
    "currency": "USD",
    "price": 7.99,
    "free": false,
    "summary": "&quot;EasyQuit&quot; is an app that will help you quit drinking immediately or by using a &quot;quit drinking slowly&quot; mode.<br>It has many motivational features such as the money you save, motivational health statistics about your body and how it improves without alcohol and personal motivations with a reminder function.<br><br><br><b>Motivational Health Section</b><br>★ Countdown timer to watch many aspects of your health improve as a result of your great decision to stop this bad habit.<br><br>★ See how much <b>money you saved</b> by not drinking and set a <b>custom treat</b> to buy from your savings.<br><br>★ Play a <b>game of memory</b> to distract yourself from the urge to have a drink.<br><br>★ <b>&quot;Quit Slowly&quot; Mode</b> with a customised plan and reminders to ease your body into quitting drinking.<br><br>★ Write your own personal motivations of why you want to stop drinking alcohol and let the app remind you of them daily.<br><br>★ <b>64 Beautiful Badges</b> for your sobriety time and drinks passed; with congratulation reminders and sharing functionality.<br><br>★ <b>28 beautiful themes</b> to personalise your experience.<br><br>★ <b>High level of Privacy.</b> No log in, no collection or selling of your sensitive data like email, password or contacts. Your data is saved locally on your phone.<br><br>★ <b>Two awesome widgets</b> to put on your home screen and always see the money you saved by quitting drinking and your time as an alcohol free person.<br><br><br>I hope my sobriety counter app helps you break this habit and stop drinking for good to become a sober healthy person for ever :)",
    "scoreText": "4.9",
    "score": 4.885246,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 14
  },
  {
    "title": "Body Measurement Tracker",
    "appId": "io.interapptive.measureup",
    "url": "https://play.google.com/store/apps/details?id=io.interapptive.measureup",
    "icon": "https://play-lh.googleusercontent.com/pndIrpC8VbGONQyXIsNGDeJcNMDMc6SKaV-6y8EwY46zxi6ZqB_W1FpcTx3CWqtWR_1D",
    "developer": "InterApptive",
    "currency": "USD",
    "price": 2.49,
    "free": false,
    "summary": "Do you want to track your weight loss (or muscle gain) journey but struggle to find a simple, no-fuss app?<br><br>You&#39;ve tried recording measurements in notes or spreadsheets but find that it takes too long... Or, you can&#39;t find a way to chart your progress in a way that makes sense?<br><br>Not to worry! Measure Up is your no-fuss, easy-to-use <b>Weight &amp; Body Measurement Tracker</b> tool for tracking weight loss and muscle gains!<br><br>The interface provides the fastest method for recording measurements and highlights which body parts have and haven&#39;t been tracked on a given day. You&#39;ll never lose where you&#39;re up to!<br><br>Don&#39;t waste any more time interpreting your progress. Your weight loss &amp; muscle gain progress is now easy to follow. Find all of your measurement history in a single location! View data in Chart, Table and List formats. Pick one that works for you!<br><br>Integrate with Google Fit to sync measurements with your favorite health apps.<br><br>Get started today!<br><br><h2>Key Features</h2><br><h3>Easy Measurements</h3><br>- Quickly add measurements with our simple-to-use interface.<br>- Add past measurements by adjusting the date.<br>- Estimate your body fat quickly and easily using the in-app body fat calculator.<br><br><h3>Chart Analysis</h3><br>- Our unique chart allows you to view all your data in one spot!<br>- Toggle measurements on and off from the legend toolbar.<br>- Stack your lean mass, body fat and muscle to get a clear picture of how you are progressing with your goals.<br>- Export to PNG image format and share via popular apps.<br><br><h3>Your Measurement History</h3><br>- View all of your measurement history and notes.<br>- Toggle between Table and List view to access data the way you want!<br><br><h3>Analysis &amp; Key Stats</h3><br>- View your body composition and Body Mass Index (BMI).<br><br><h3>Customizable Measurements &amp; Colors!</h3><br>- Add your own custom Length, Weight or Percentage measurements.<br>- Change up the colors of your measurements and chart.<br><br><h3>Other Great Features:</h3><br>- Data Back Up &amp; Restore: Never lose your data! Back up information any time to your chosen cloud storage service.",
    "scoreText": "4.6",
    "score": 4.5555553,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 15
  },
  {
    "title": "Recognise Hand",
    "appId": "com.recognise.paidapphand",
    "url": "https://play.google.com/store/apps/details?id=com.recognise.paidapphand",
    "icon": "https://play-lh.googleusercontent.com/jsQggu-d-rXX1zfK74zoOqMna7o-vmHpu-jWlI_VTtQIqqXHBykL53GROWBp3Eca2oY",
    "developer": "Noigroup",
    "currency": "USD",
    "price": 6.49,
    "free": false,
    "summary": "Using Recognise™ has been shown to reduce pain, improve performance and assist with rehabilitation in a range of complex pain, and injury states, when used as part of a Graded Motor Imagery programme.<br><br><br>TEST AND TRAIN<br><br>- TEST your ability to quickly and accurately recognise an image of a body area as either left or right (‘Left/Right Discrimination’)<br><br>- TRAIN your brain and harness its neuroplasticity using a range of tools<br><br><br>FEATURES<br><br>-‘Memory’ and ‘Speed match’ tools to take your training to the next level<br><br>-Graded difficulty levels and personal best challenges<br><br>-Detailed onscreen results and graphs to map your progress<br><br>-Powerful clinical integration tools - export and email your results directly to your clinician or therapist<br><br>-Capture your own images on your Device and use them in your training<br><br>-Comprehensive explanation of the science behind Left/Right Discrimination and Graded Motor Imagery",
    "scoreText": "3.2",
    "score": 3.2,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 16
  },
  {
    "title": "Little Bean - Cosmetic Checker",
    "appId": "com.littlebeanapp",
    "url": "https://play.google.com/store/apps/details?id=com.littlebeanapp",
    "icon": "https://play-lh.googleusercontent.com/ojnvA5C3cm6UsqwDd0-yL-bCmdbiFhIHgdcRrdAjWGJ5QsyypUq5N-fIBqMgjCEObrnP",
    "developer": "Little Bean App LLC",
    "currency": "USD",
    "price": 0.99,
    "free": false,
    "summary": "Eliminate toxic products from your beauty, skincare, and makeup routine with [ Little Bean ] — the cosmetic checker for pregnant women. <br><br>Loved by thousands of expecting mothers, this skincare ingredient checker ensures the safety of every beauty product in your skincare and makeup regimen.<br><br>[ Try The Join Moms Who ]:<br>• 🏆 Seek the top pregnancy app beauty product scanner /<br>• 💡 Confidently explore top beauty brand ingredients / <br>• 🌿 Go for pregnancy-approved skincare /<br>• 📸 Instantly visualize product contents /<br>• 🔍 Swiftly scan product ingredients /<br>• 👶 Prioritize their baby&#39;s health /<br>• 💄 Avoid toxic products /<br><br>[ Cosmetic Checker ]:<br><br>• Cross-check beauty products with the ingredient checker. Ensure pregnancy safety using our cosmetic checker before you shop at Curology, Think Dirty, and online stores.<br><br>[ Easy Ingredient Checker ]:<br><br>• 📲 Point your phone’s camera at the ingredient list of any beauty product to scan and spot harmful ingredients in real-time. <br>• 🌐 Online shopping? Upload a skincare product ingredient list and get instant safety insights on toxic products.<br>• 🔎 Curious about a specific ingredient? Dive into our comprehensive ingredient list database.<br><br>[ Personalized Skincare Recommendations ]:<br><br>• ⚠️ Found a questionable ingredient? We&#39;ll suggest safe pregnancy beauty alternatives.<br><br>[ Health &amp; Pregnancy Alignment ]:<br><br>• 📚 Our curated database includes over 90 types of ingredients common in top beauty brands. With guidance from medical professionals, your baby&#39;s health is in focus.<br>• 💄 Wondering about an ingredient in your Estee Lauder or Clinique product? Trust our pregnancy cosmetic checker.<br><br>[ Brands &amp; Stores Galore ]:<br><br>• 🛍️ Curious about Ipsy, Lancome, Kylie Cosmetics, Drunk Elephant, or products from stores like Sallys Beauty Supply? We cover a vast array of skincare brands to ensure pregnancy-safe beauty choices.<br><br>Download 📥 [ Little Bean ] and elevate your pregnancy beauty routine. Questions or suggestions? 📩 Drop us a line at info@littlebeanapp.com.",
    "scoreText": "5.0",
    "score": 4.96,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 17
  },
  {
    "title": "Peptide Mixing Calculator PRO",
    "appId": "com.ahemblah.usacalculators",
    "url": "https://play.google.com/store/apps/details?id=com.ahemblah.usacalculators",
    "icon": "https://play-lh.googleusercontent.com/l0UPkumyn48hudi7zGD8Ce7EsM6VmiHVz-eOHMabjwy2nHfaw7IXiiWWVQDIUbFH8kI",
    "developer": "Appsoup",
    "currency": "USD",
    "price": 3.49,
    "free": false,
    "summary": "A peptide mixing calculator is a simple calculator that helps you determine how many milligrams (mg) of research are in each unit of an insulin/tuberculin (non-insulin syringe). It is a simple way to calculate peptide doses.<br><br>The peptide calculator measures reconstitution and peptide dosage for research. Microgram (mcg) peptide measurements are used to find dosage in each unit and tick mark on an insulin syringe.<br><br>We also provide a converter that will convert micrograms (mcg or ug) to milligrams (mg) and milliliters (mL) to microliters (uL).",
    "scoreText": "0.0",
    "score": 0,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 18
  },
  {
    "title": "Clock Yourself",
    "appId": "com.nextstepalliedhealth.clockyourself",
    "url": "https://play.google.com/store/apps/details?id=com.nextstepalliedhealth.clockyourself",
    "icon": "https://play-lh.googleusercontent.com/Bb4P16An5IIkQQgf4Z2j5gEbP4qIWhiMYfV2BGWspVVYtz8amDt9c2e_GWRNIOPXUiU",
    "developer": "Next Step Allied Health PtyLtd",
    "currency": "USD",
    "price": 2.99,
    "free": false,
    "summary": "WHAT IS CLOCK YOURSELF?<br><br><br>Clock Yourself challenges you to think on your feet.<br><br><br>It involves exercise for your body and your brain, at the same time.<br><br>Every challenge will stimulate your brain in a different way.<br><br><br>You don&#39;t have to master one challenge before you can explore another challenge.<br><br><br>Some call this an exercise app. <br><br>Some call this a brain games app.<br><br>Why can’t it be both?!<br><br><br><br>WHO CAN USE CLOCK YOURSELF?<br><br><br>Everyone!<br><br><br>Clock Yourself exercises involve stepping on a circle that you visualise beneath your feet. It’s perfect for exercise at home.<br><br><br>Athletes often modify Clock Yourself exercises outdoors for sport-specific agility drills, by visualising a much larger circle and running between the coordinates.<br><br><br>Similarly, people who are unable to walk can modify Clock Yourself to practise reaching with their arms, or wheelchair agility!<br><br><br>If you think you’re too slow to use Clock Yourself, you’re probably wrong.<br><br>If you think you’re too fit to use Clock Yourself, you’re definitely wrong!<br><br><br><br><br><br>WHY DID WE MAKE CLOCK YOURSELF?<br><br><br>The Clock Yourself concept originated in neurological rehabilitation. Now anyone can use it to exercise at home and harness their neuroplasticity.<br><br><br>It was developed by Australian physiotherapist @MegLowryPT and software developer Dave Wallace, with input from people with a variety of abilities. <br><br><br><br>We had 5 goals:<br><br><br>1. Make it fun - Clock Yourself exercises are so entertaining that you’ll show your friends at parties!<br><br><br>2. Make it versatile - Both the stepping speed and the cognitive complexity are in your control.<br><br><br>3. Make it evidence based - This is a volitional step training method. Volitional stepping trains faster steps in all directions to improve your chances of catching yourself during a fall.<br><br><br>4. Make it portable - There is no need to set up mats, wires or sensors. It also works offline. It only requires internet for your initial download from the App Store.<br><br><br>5. Make it affordable - This is a once off purchase for pocket change. It has no recurring subscriptions and no advertisements.<br><br><br><br><br>IS CLOCK YOURSELF AVAILABLE IN OTHER LANGUAGES?<br><br><br>Yes and no.<br><br><br>At this stage, all of the buttons and instructions are in English only.<br><br><br>However, if you click the Options button within each challenge (except for the Simple Colours challenge) you can choose to play the audio prompts in six other languages.<br><br><br>Mandarin<br><br>Japanese<br><br>French <br><br>German<br><br>Spanish<br><br>Dutch<br><br><br>What are you waiting for?  Go ahead and Clock Yourself!<br><br><br>“A person who never made a mistake never tried anything new” - Albert Einstein<br><br><br><br>EXPLANATION OF APP PERMISSIONS<br><br>When you install Clock Yourself, the Google Play app store requests that you give us certain permissions. <br>The permissions are requested for these specific purposes:<br><br>Storage - Clock Yourself requests this permission to save your activity log to your device. <br><br>Your activity log counts how many steps you&#39;ve done with Clock Yourself and how many minutes you exercised for etc. The app asks permission to access your storage so that your activity log data can be kept on your phone&#39;s storage, rather than storing it on the internet. <br><br>Network Access - Clock Yourself requests this permission so it can access your device&#39;s internet connection if you choose to send your activity log file to an email address of your choosing.",
    "scoreText": "4.7",
    "score": 4.6571426,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 19
  },
  {
    "title": "White Noise Pro",
    "appId": "com.tmsoft.whitenoise.pro",
    "url": "https://play.google.com/store/apps/details?id=com.tmsoft.whitenoise.pro",
    "icon": "https://play-lh.googleusercontent.com/zZeL2m25PN28-DTkzVNy8jlJKkhIH6c5TE8oFNmsigDwHIxgpgP_qB42Z-gCiLSkxlyA",
    "developer": "TMSOFT",
    "currency": "USD",
    "price": 2.99,
    "free": false,
    "summary": "As seen multiple times on the Today Show--Find out why the world is sleeping better with White Noise Pro. Features ambient sounds of the environment to help you relax during the day and sleep great at night.<br><br>Do you have trouble going to sleep?  Are you traveling on a plane and need a quick power nap?  Does your newborn baby wake up in the middle of the night?  There are numerous benefits to using White Noise:<br><br>•\tHelps you sleep by blocking distractions<br>•\tRelaxes and reduces stress<br>•\tPacifies fussy and crying babies<br>•\tIncreases focus while enhancing privacy<br>•\tSoothes headaches and migraines<br>•\tMasks tinnitus (ringing of the ears)<br><br>Even when you’re asleep, your brain is constantly scanning and listening for sounds. If it’s too quiet, unwanted noises such as faucet drips or police sirens can interrupt your sleep. White Noise generates sounds over a wide range of frequencies, masking those noise interruptions, so you can not only fall asleep, but stay asleep.<br><br>SOUND CATALOG<br><br>50 HD sounds are included as part of the application (no downloading required unless you want more) including all the color noises (brown, white, pink, etc), mechanical sounds like box fan or air conditioner, light to heavy rains, rushing water sounds, beach and ocean waves, and so much more.  For the entire list of sounds please visit our website.  No streaming is required for playback.<br><br>APPLICATION FEATURES<br>•\t50+ HD full stereo sounds that are exclusive to White Noise Pro<br>•       Generate binaural beats, custom color noises, and tones using the pro generator tools included with White Noise Pro<br>•\tDownload additional sounds for free with the White Noise Market app or website:  https://whitenoisemarket.com<br>•       Record, loop, and share new sounds with total ease<br>•\tBackground audio support so you can use other apps while listening<br>•       App Widget and Chromecast TV support for audio control and playback.  (Note: Chromecast audio devices require using the Google Home app)<br>•\tCreate new soundscapes by mixing multiple noises together with support for adjusting volume, balance, pitch, and variance of each individual sound in the mix.<br>•\tFull screen digital clock with multiple colors and brightness controls makes it the perfect companion for any nightstand<br>•\tAdvanced alarm and timer system that slowly fades audio in and out so you awake naturally feeling more refreshed.  Supports music alarms too with Android 5.0 devices.<br>•\tCreate a playlist of your favorite sounds and mixes to enjoy different ambiences throughout the day<br>•\tOn-screen media and volume controls with swipe gesture support for quickly navigating sound collection<br>•\tAdvanced Settings let you prevent interruptions such as notifications, tweak buffer size for optimal playback, adjust sound volume, balance, pitch, custom alarm snooze times, and more.  All the pro tools and settings you need for better sleep.<br>•\tDesigned to work on all Android-based phones and tablets<br>•\tNo Advertising<br><br>PRESS REVIEWS<br><br>TODAY SHOW:<br>&quot;Savannah&#39;s Secret to a better night&#39;s sleep.&quot;<br><br>DR. OZ SHOW: 13 Miracles of 2013<br>&quot;Revolutionary Sound App!”<br><br>AMAZING ANDROID APPS - Book by Daniel A. Begun<br>&quot;White Noise can instantly transform a chaotic environment into a calm oasis.&quot;<br><br>THE WASHINGTON POST: Smartphone Puts Newborn to Sleep <br>&quot;For the next four months, the infant slept with his father&#39;s phone in his crib and White Noise tuned to &#39;air conditioner.&quot;<br><br>HEALTH MAGAZINE: &quot;Help you turn off your brain, fall asleep faster, and get the rest you desperately need&quot;<br><br>PERMISSIONS EXPLAINED:<br><br>WAKE_LOCK / DISABLE_KEYGUARD: Alarms unlock and wake the device<br>WRITE_EXTERNAL_STORAGE: Importing and exporting sounds require external storage<br>MICROPHONE: Only used to create and loop new recordings<br>CAMERA: Only used to assign photos to your recordings<br>LOCATION: Only used to assign location to new recordings<br><br>Visit our website at https://www.tmsoft.com/white-noise/ for additional details.",
    "scoreText": "4.4",
    "score": 4.42,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_paid",
    "rank": 20
  },
  {
    "title": "Fitbit",
    "appId": "com.fitbit.FitbitMobile",
    "url": "https://play.google.com/store/apps/details?id=com.fitbit.FitbitMobile",
    "icon": "https://play-lh.googleusercontent.com/QhMCymTyxJbzRiwMBA-GYooS-nVKm3fHg2CSRyKHvhmC-e5vOibfST73y1MmScvtPw",
    "developer": "Google LLC",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "See the big picture on your health and fitness journey with the Fitbit app. Find easy ways to get active, sleep better, stress less and eat healthier.<br><br>Track the stats you care about across health, fitness and sleep, and change your goals as your routines evolve. Stay motivated with energizing workout content for your body and mind. See how far you’ve come with a glance at your personal goal progress and how you stack up to friends and family. Unlock even more possibilities when you sync up with a wearable device like Fitbit tracker or smartwatch and see how your activity, sleep, nutrition and stress all fit together.<br><br>GET MORE ACTIVE: See how small moves add up by using your smartphone to track steps and distance—or pair with a Fitbit tracker or Wear OS by Google smartwatch to record your heart rate, Active Zone Minutes, calories burned and more. Leverage tiles and complications to easily access your stats.It’s a fitness planner in your pocket: Use the app as a diary to set goals and track your progress. Plus, that motivation you’ve been looking for is right in the app. Bring the gym home with a curated list of audio and video workouts that you can do at your own pace, right from your living room.* You’ll find sessions for HIIT, cardio, strength, running, biking, yoga and more.<br><br>TRACK YOUR HEART HEALTH: Understand your overall health by using your watch or tracker to keep tabs on your heart rate 24/7. Monitor your heart rhythm and see your resting heart rate trends, plus time spent in heart rate zones during workouts.<br><br>SLEEP BETTER: Find sleep tools to help you learn about your sleep quality and improve it—from  measuring your sleep duration and sleep stages to understanding your restless time. Set reminders for bedtime and wake-up time to keep your sleeping schedule managed.<br><br>STRESS LESS: Listen to audio sessions to lessen stress and improve your mood. Use mindfulness to start your day a better way, find moments of calm and set intentions with meditation or get help falling asleep with breathing exercises and relaxing sounds.*<br><br>EAT SMARTER: Keep your diet in check with easy-to-use tools for setting goals. Tracking meals and logging food &amp; water intake lets you see if you’re getting enough protein, fat, fiber and carbs on your way to managing your weight and overall health.<br><br>EVEN MORE WITH FITBIT PREMIUM: Upgrade to Fitbit Premium and get all the guidance, insights and inspiration you need to take your workout routine to the next level.<br><br>• Your Daily Readiness Score helps you understand when it’s time to go all out and when it’s time for rest &amp; recovery—plus, you’ll get recommended workouts based on your body’s needs.<br>• Get the support you need across a whole library of workouts to keep your mind and body fit—from strength training, HIIT and cycling to dance cardio, yoga, meditation and more—led by Fitbit’s expert trainers who are ready to coach.<br>• Perfect your mindfulness practice with a full library of sessions that calm anxiety, prep for sleep and even help you meditate while walking.<br>• Find new ways to rest &amp; recover with your Sleep Score. Plus, check out your sleep patterns and monthly trends in your Sleep Profile.<br>• Feed your appetite with access to easy, healthy recipes to help you reach your nutrition goals and bring your wellness full circle.<br><br><br>*A Fitbit Premium subscription is required to access the full content library.<br><br>Some Fitbit devices let you handle calls and texts right from your wrist so permissions might be required during setup.",
    "scoreText": "4.1",
    "score": 4.110233,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 1
  },
  {
    "title": "MyFitnessPal: Calorie Counter",
    "appId": "com.myfitnesspal.android",
    "url": "https://play.google.com/store/apps/details?id=com.myfitnesspal.android",
    "icon": "https://play-lh.googleusercontent.com/DtR_W1lA1tKsbrr2DUo3TLNzqi9qRyxPqDuCyJeGLU6OMJKqg7CEqs45btRqvDFNDI3Y",
    "developer": "MyFitnessPal, Inc.",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Achieve your nutrition, calorie, macro, and fitness goals with MyFitnessPal. MyFitnessPal is a comprehensive food and fitness tracker, with everything you need to reach your goals. Macros, calories, food, and workouts – track it all in one place.<br><br>Change your habits with fitness and food. Download our health and nutrition app and start your free Premium trial today. With MyFitnessPal, you have access to exclusive food inspiration, an intermittent fasting tracker, fitness logging tools, expert guidance, and the calorie tracker. You’ll soon discover why MyFitnessPal is the #1 nutrition and food tracking app in the U.S and has been featured in the New York Times, Forbes, the Today Show, and U.S. News &amp; World Report.<br><br><br>MyFitnessPal is more than a calorie tracker &amp; food journal. Monitor your health and fitness progress within the app.<br><br>MYFITNESSPAL FEATURES<br><br>Food Tracker – Track Calories &amp; Macros<br>■ Food tracking made easy. Quickly log your meals throughout your day from over 20.5 million foods (including restaurant dishes) from one of the largest food databases available<br>■ Macro tracker lets you see carbs, fat, &amp; protein breakdown—no need for a separate app! Set goals for macros, protein, sodium, fiber, and more<br>■ Make sure you’re staying hydrated with our water tracker<br><br>Fitness – Track Workouts, Weight, and Progress<br>■ Activity Tracker – Add workouts and steps with the integrated fitness tracker<br>■ See Your Fitness Progress – Track at a glance, or analyze the details of your diet &amp; macros<br>■ Stay Inspired – Keep your diet and fitness routine exciting with workouts and food inspiration<br>■ Exercise and Count Calories – See how your workouts, fitness, and diet affect daily calorie goals<br>■ Track With Wear OS – A calorie counter, water tracker, and macro tracker on your watch. Add complications to the home screen for faster logging, and the tile for tracking different nutrients at a glance.<br><br>Workouts &amp; Meal Plans, Tailored to You<br>■ Customize your health &amp; fitness goals – Weight loss, weight gain, weight maintenance, nutrition, &amp; fitness<br>■ Personalized dashboards – Fitness, health, and diet stats are all in one place to easily see and track your progress<br><br>■ Add Your Own Meals/Food Tracker – Save recipes and meals for quick logging and keep tabs on your diet<br>■ Follow the new easy meal planner to simplify tracking and help hit your goals<br>■ Connect 40+ Apps &amp; Devices – From smartwatches, fitness trackers, and other health and fitness apps, track your intake and activity through your watch with WearOS<br>■ Get Connected– Find friends and motivation in our active MyFitnessPal forums<br><br>Premium<br>■ Reach your goals with barcode scan, meal scan, and voice logging<br>■ Customize macros and set custom goals<br>■ Enjoy ad-free food logging with insights and comparisons built into premium <br>■ Net Carbs Mode/Carb Tracker – Keep track of your low-carb or keto diet, view net carbs in your food<br><br>Premium Plus - Expanded Features to Help Hit Your Goals<br>■ All of the Premium features, like barcode scanning now available with meal planning<br>■ Personalized meal plans, integrated grocery delivery, and smart meal tracking tools<br>■ Your one-stop shop for meal planning, grocery shopping, food logging, and nutrition insights to help you reach your goals<br>■ 1000s of healthy recipes to help you reach your goals<br><br>MyFitnessPal is the leading health and nutrition app that helps you learn about your food habits, monitor your diet and conquer your health goals.<br><br>Download Today and Start Your Free Premium Trial<br><br>View our terms &amp; conditions and privacy policy: <br>https://www.myfitnesspal.com/terms-of-service<br>https://www.myfitnesspal.com/privacy-policy",
    "scoreText": "4.4",
    "score": 4.3973475,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 2
  },
  {
    "title": "Finch: Self-Care Pet",
    "appId": "com.finch.finch",
    "url": "https://play.google.com/store/apps/details?id=com.finch.finch",
    "icon": "https://play-lh.googleusercontent.com/fsYShU5YDNZxBQgZF-UjT-cq7Mxtqmz71_Q8isHj3DzpOX9Me4KZLD780Oe2DxTRVPzA76xlDNigl9SXjEsPfw",
    "developer": "Finch Care Public Benefit Corporation",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Meet your new self-care best friend! Finch is a self-care pet app that helps you feel prepared and positive, one day at a time. Take care of your pet by taking care of yourself! Choose from a wide variety of daily self-care exercises personalized for you.<br><br>BEST DAILY SELF-CARE TRACKER ✨<br>Is self-care a chore? Struggling with habits, self-love, or depression? Self-care finally feels rewarding, lightweight, and fun with Finch. Complete quick self-care exercises to grow your pet, earn rewards, and improve mental health! People who struggle with mood journaling, habits, and depression found it easier to be mindful with their self-care pet in Finch!<br><br>EASY DAILY CHECK INS ✏️<br>• Start mornings with quick mood checks and energize your pet to go exploring! Choose from various mindful habits from goal tracking and mood journaling to mindful breathing exercises and quizzes!<br>• End days in moments of gratitude with your self-care pet where they&#39;ll return from adventures to share stories with you! Recognize positive moments and grow your self-love.<br><br>MINDFUL HABITS 🧘🏻<br>Finch is the fun self-care tracker to hit goals and sustain healthy habits! Build mental resilience against stress, anxiety, and depression. Strengthen your mental health by increasing self-love and gratitude.<br><br>• Habit Tracker: set goals and celebrate wins for healthy habits.<br>• Mood Journal: guided mood journal to clear the mind, track important moments, and practice self-love.<br>• Breathing: guided breathing to calm nerves, increase focus, energize your mind, and sleep better.<br>• Quizzes: understand your mental health with quizzes for anxiety, depression, body image appreciation, and more.<br>• Mood Tracker: quick mood checks with mood trends to understand what has been lifting you up or bringing you down.<br>• Quotes: motivational quotes to lift your mood and gain new perspective.<br>• Insights: get insights on your mental health from combined analytics on your mood journaling, tags, goal tracker, and quizzes.<br><br>SAY HI 👋🏼<br>• TikTok: https://www.tiktok.com/@finchcare<br>• Discord: https://discord.gg/finchfam<br>• Instagram: https://www.instagram.com/finchcare/<br>• Facebook: https://facebook.com/groups/finchfam<br>• Email: support@befinch.com",
    "scoreText": "4.9",
    "score": 4.9033384,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 3
  },
  {
    "title": "Strava: Run, Bike, Hike",
    "appId": "com.strava",
    "url": "https://play.google.com/store/apps/details?id=com.strava",
    "icon": "https://play-lh.googleusercontent.com/j-ZV144PlVuTVsLuBzIKyEw9CbFnmWw9ku2NJ1ef0gZJh-iiIN1nrNPmAtvgAteyDqU",
    "developer": "Strava Inc.",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "<b>Join over 180 million active people on Strava – the free app where building community meets fitness tracking.</b> <br><br>Whether you&#39;re a world-class athlete or just starting out, Strava has your back the entire journey. Here&#39;s how: <br><br><b>Track your growth</b> <br><br>• <b>Record It All:</b> Running, cycling, walking, hiking, yoga. You can record all those activities – plus over 40 other sport types. If it&#39;s not on Strava, it didn’t happen. <br>• <b>Connect Your Favorite Apps and Devices:</b> Sync with thousands of devices like Apple Watch, Garmin, Fitbit and Peloton – you name it. The Strava Wear OS app includes a tile and a complication you can use to quickly launch activities.<br>• <b>Understand Your Progress:</b> Get data insights to see how you&#39;re improving over time. <br>• <b>Compete on Segments:</b> Show off your competitive streak. Race against others on segments to the top of the leaderboards and become the King or Queen of the Mountain. <br><br><b>Find and connect with your crew</b> <br><br>• <b>Build a Support Network:</b> Take the Strava community offline and meet in real life. Use the Clubs feature to join local groups or create your own. <br>• <b>Join and Create Challenges:</b> Participate in monthly challenges to chase new goals, collect digital badges and stay motivated while encouraging others. <br>• <b>Stay Connected:</b> Your Strava feed is filled with real efforts from real people. Follow friends or your favorite athletes and send kudos to celebrate every win (big and small). <br><br><b>Move with confidence</b> <br><br>• <b>Move Safer with Beacon:</b> Share your real-time location with loved ones for an extra layer of safety during your activities. <br>• <b>Control your privacy:</b> Adjust who can see your activities and personal data. <br>• <b>Edit Map Visibility:</b> Hide the beginning or end points of your activities. <br><br><b>Get even more with a Strava subscription</b><br>•  <b>Discover Routes Anywhere:</b> Get intelligent route recommendations with popular routes based on your preferences and location, or create your own bike routes and footpaths using our Routes tool. <br>• <b>Live Segments:</b> Receive real-time updates on your performance during popular segments. <br>• <b>Training Log &amp; Best Efforts:</b> Dive deeper into your data to understand your progress and set new personal records. <br>• <b>Group Challenges:</b> Create challenges with friends to stay motivated together. <br>• <b>Athlete Intelligence (AI):</b> Access AI-driven insights that makes your workout data easy to understand. No confusion. No guesswork. <br>• <b>Access Recover Athletics:</b> Prevent injury with custom exercises tailored to your activities.<br>•  <b>Goals:</b> Set custom goals for distance, time or segments, and stay motivated as you work towards them. <br>• <b>Deals:</b> Enjoy special offers and discounts from our partner brands.<br>• <b>Training Log:</b> Dive deeper into your data with detailed training logs and track your progress over time. <br><br>Whether you’re aiming for a personal best or just getting started, you belong here. Just record and go. <br><br>Strava includes both a free version and a subscription version with premium features. <br><br>Terms of Service: https://www.strava.com/legal/terms Privacy Policy: https://www.strava.com/legal/privacy NOTE ON GPS SUPPORT: Strava depends on GPS for recording activities. In some devices, the GPS does not work properly and Strava will not record effectively. If your Strava recordings show poor location estimation behavior, please try to update the operating system to the most recent version. There are some devices which have consistently poor performance with no known remedies. On these devices, we restrict installation of Strava, for example the Samsung Galaxy Ace 3 and the Galaxy Express 2. See our support site for more information: https://support.strava.com/hc/en-us/articles/216919047-Supported-Android-devices-and-Android-operating-systems",
    "scoreText": "4.5",
    "score": 4.462746,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 4
  },
  {
    "title": "Calm - Sleep, Meditate, Relax",
    "appId": "com.calm.android",
    "url": "https://play.google.com/store/apps/details?id=com.calm.android",
    "icon": "https://play-lh.googleusercontent.com/S76GphUu2pZa249td2Bb4XAhLcPRrFdL1zp_5qU1ouukvRq9r0-8jJ-CruaTtdT6g84",
    "developer": "Calm.com, Inc.",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Calm is the #1 app for sleep, meditation and relaxation. Manage stress, balance moods, sleep better and refocus your attention. Guided meditation, Sleep Stories, soundscapes, breathwork and stretching exercises fill our extensive library. Practice self-healing and discover a happier you through Calm.<br> <br>Feel better by reducing anxiety, prioritizing your self-care and choosing a guided meditation session that fits within your busy schedule. Introduce mindfulness and breathing exercises into your daily routine and experience their life-changing benefits. Meditation novice or seasoned expert, Calm is for anyone who is looking to improve their sleep and address everyday stress.<br> <br>Sleep better with Sleep Stories, bedtime stories that lull you into a restful slumber. Relaxing sounds and calming music also help you meditate, focus and sleep soundly. Balance your mood and improve your sleep cycle by picking from 100+ exclusive Sleep Stories, narrated by well-known talent like Cillian Murphy, Rosé, and Jerome Flynn. Meditate daily to relieve anxiety and learn to put your personal health first.<br> <br>Take a deep breath and find your Calm.<br> <br>CALM FEATURES<br> <br>MEDITATION &amp; MINDFULNESS<br>* Meditate with seasoned experts, regardless of your experience level<br>* Be mindful in your daily routine and learn to calm your thoughts<br>* Mindfulness topics include Deep Sleep, Calming Anxiety, Focus and Concentration, Breaking Habits and so much more<br> <br>SLEEP STORIES, RELAXING MUSIC &amp; SOUNDSCAPES<br>* Sleep soundly listening to Sleep Stories, bedtime stories for adults and children alike<br>* Tackle insomnia with calming music, sleep sounds and full soundscapes<br>* Self-care: Sleep content to help you relax and get into a state of flow<br>* Relax and experience deep sleep with new music added every week, from top artists<br> <br>ANXIETY RELIEF &amp; RELAXATION<br>* Stress management and relaxation with daily meditation and breathing exercises<br>* Self-healing through Dailies - Reduce anxiety with daily 10-minute original programs like the Daily Calm with Tamara Levitt or the Daily Trip with Jeff Warren<br>* Mental health is Health - Tackle social anxiety and  personal growth through inspiring stories<br>* Self-care through mindful movement: Relax your body during the day with Daily Move<br> <br>ALSO FEATURING<br>* Emotion and mental health tracker through Daily Streaks &amp; Mindful Minutes<br>* Feel better with 7- and 21-day mindfulness programs for beginner &amp; advanced users<br>* Soundscapes: Nature sounds and scenes to calm your nerves<br>* Breathing exercises: Find peace and concentration with a mental health coach<br> <br>Calm is free to download and use. There are never any ads and some of the programs and features are free forever. Some content is only available through an optional paid subscription. If you choose to subscribe, payment will be charged to your Google Account at confirmation of purchase.<br> <br>Be sure to check out our Wear OS app with tiles to quick-start breathing exercises and complications that help you track meditations.<br><br>What is Calm?<br>Our mission is to make the world a happier and healthier place. Through our website, blog, and app—filled with meditations, sleep stories, music, movement, and more—we’re redefining what mental health care looks like in 2021 and beyond. With over 100 million users worldwide, 100,000 new users daily, and our growing partnerships with major companies, we’re having a positive effect on more and more people each day.<br> <br>Calm is recommended by top psychologists, therapists, mental health experts, and the press:<br><br>* “I’m generally wary of meditation apps because they sometimes weave in too much mystic talk for my taste. But Calm instead contains guidance like ‘Concentrate on your body’” - New York Times<br><br>* “In the frenetic, crazy, digital world we live in, sometimes it&#39;s necessary to take a step back and smell the roses” - Mashable<br> <br>* “Eliminating distraction...ended up helping me relax and realize that all the stuff I was stressing about wasn&#39;t that big a deal” - Tech Republic",
    "scoreText": "4.5",
    "score": 4.4605174,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 5
  },
  {
    "title": "Flo Ovulation & Period Tracker",
    "appId": "org.iggymedia.periodtracker",
    "url": "https://play.google.com/store/apps/details?id=org.iggymedia.periodtracker",
    "icon": "https://play-lh.googleusercontent.com/S2NYJ-zQxMfCGe4NyP_jRQmoNHeLB0TwlDqNSA6BKKWgm3GHWVhbXiLpejzyiLkAG7qM",
    "developer": "Flo Health Inc.",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Welcome to Flo! The world’s leading period, pregnancy, and cycle tracker. Join over 430 million members who use Flo as their go-to pregnancy &amp; ovulation tracker &amp; cycle calendar. With seven million five-star ratings, we&#39;re paving the way to better female healthcare by empowering people with periods to harness their body&#39;s signals.<br><br><b>Flo for Partners</b><br>Link your Flo account with your partner so they can see updates on your cycle and pregnancy. Period and fertile days predictions, we&#39;ll provide them with insights and actions they can take to support you better. Use Flo for Partners to maximize your connection when tracking your period, ovulation, or pregnancy.<br><br><b>There&#39;s more to tracking your period:</b><br>- <b>Menstrual and Period Tracker</b>: Understand symptoms like vaginal discharge and mood swings by tracking your period with Flo&#39;s ovulation and period calendar, developed in collaboration with over 100 health experts.<br>- <b>Ovulation &amp; Fertility Window Tracker</b>: Understand your fertile cycle and benefit from expert insights, tailored content, and information about conception and fertility.<br>- <b>Women&#39;s Health Tracker</b>: This is a calendar for your cycle, ovulation, weight, water intake, physical activity, and mood. Track your symptoms to prepare for your period.<br>- <b>Pregnancy Tracker App</b>: Receive expert information for a healthy pregnancy and birth with Flo&#39;s pregnancy calendar.<br>- <b>New! Flo supports perimenopause:</b> Know what might be perimenopause and how to tune in to your body’s changes. Get clarity on common perimenopause symptoms and what can help.<br><br><b>How to maximize your use of Flo’s menstrual, period, and ovulation tracker and calendar:</b> <br>- Anonymous Mode: Enjoy Flo while maintaining your privacy and protecting your identity. Your name, email address, and technical identifiers will not be connected to your health data in your new Flo account.<br>- Reminders: Personalize Flo&#39;s menstrual and period tracker with scheduled reminders to track your cycle&#39;s start and end date. Receive notifications about ovulation, birth control pills, sleep, water intake, and more.<br>- Secret Chats: Safely discuss intimate topics from fertility to birth control in our supportive global community.<br>- Content Library: Explore thousands of articles and videos on women&#39;s health, periods, ovulation, birth control, fertility, and pregnancy.<br>- Health Assistant: Chat with our virtual assistant about late periods, irregular cycles, PMS, etc.<br>- Check if symptoms match those common of PCOS, endometriosis, or perimenopause with our Symptom Checker tool.*<br>- Wear OS complications &amp; tiles: Set up a tile and complication on your watch for insights about your cycle. Flo period tracker is compatible with Wear OS 3. <br>- Use your tax-free funds on a subscription: Flo Premium memberships can be purchased using FSA/HSA dollars.**<br><br>Please note: Flo is not a diagnostic tool and should not be used as a method of contraception or to facilitate conception. Predictions and insights provided by the app are intended for informational purposes only and are not a substitute for professional medical advice, diagnosis, or treatment. Always consult a qualified healthcare provider for any health concerns or decisions.<br><br>Contact <b>support@flo.health</b> for assistance.<br><br>To access our accessibility statement, visit: https://flo.health/accessibility-statement-android?current-location=auto-detect<br><br>*Not available in the UK or EU/EEA.<br>**As of October 12, 2024. Following the SIGIS Eligible Product List. US only. Some FSA/HSA plan providers have different eligibility rules. Contact your provider in advance.",
    "scoreText": "4.7",
    "score": 4.713076,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 6
  },
  {
    "title": "MacroFactor - Macro Tracker",
    "appId": "com.sbs.diet",
    "url": "https://play.google.com/store/apps/details?id=com.sbs.diet",
    "icon": "https://play-lh.googleusercontent.com/4gfovnH1uoLSJr-ga0iswuqW-jR7Go1iQdJTVWblLLrb3DeAGj1VqtF8n-lFi2e6hWEIBVshkGqTqjjIl99AptM",
    "developer": "Stronger By Science Technologies LLC",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "MacroFactor combines innovative coaching algorithms with proven nutrition and behavioral science to help you reach your diet goals and achieve empowering, sustainable results. <br><br>MacroFactor uses a dynamic algorithm to adapt to changes in your metabolism and personalize your macro plan to keep you on track.<br><br>Download to start your 7-day trial of this premium, ad-free macro tracker app. <br><br>DIET SMARTER<br><br>Using a best-in-class expenditure estimate, MacroFactor’s nutrition coach algorithm adapts to changes in your metabolism so you never plateau. <br><br>• The unique energy expenditure calculation detects changes in your metabolism<br>• Smart algorithms personalize your calorie and macro intake targets, just like a nutrition coach would<br>• Weekly check-ins keep you on track toward your goals<br><br>The result? You better understand your body’s needs and can successfully reach and sustain your goals without stress.<br><br>THE BEST MACRO TRACKER TOOLS<br><br>• The fastest macro tracker on the market with tools like barcode scan and custom foods<br>• Verified food database, so you can trust the accuracy of the foods you log <br>• Custom macro programs and weekly check-ins based on your goals and preferences<br>• Detailed breakdowns of micronutrients, macros, and more<br>• Period tracker, habit tracker, unique data insights and visualization, integrations, dark mode, and more<br><br>AN EMPOWERING, SUSTAINABLE APPROACH<br><br>MacroFactor’s robust nutrition coach algorithm will make appropriate adjustments to your calorie and macro targets based on what you log, regardless of how close you came to hitting your targets from the previous week. The algorithms don’t function any worse if you deviate from your macro targets. <br> <br>This means that unlike other nutrition coach apps, you don’t have to eat like a robot or perfectly adhere to your macro targets in order to get your weekly coaching check-in and an appropriate calorie adjustment.<br> <br>You’ll never see warnings, red numbers, or shaming when you go over your calorie or macro targets, unlike in other macro tracker apps.<br> <br>Instead, MacroFactor’s macro tracker and nutrition coach aim to empower you with the guidance and tools you need to reach your goals without stress or rigidity. <br><br>A CLOSER LOOK AT FEATURES &amp; BENEFITS<br><br>Nutrition coach<br>• Get a science-backed macro plan designed for your goals and preferences<br>• Set a goal to lose, maintain, or gain weight<br>• Smart nutrition coach AI makes weekly changes to your macro plan to keep you on track<br> <br>Macro tracker<br>• Large verified food database, so you can trust that calorie and macro information is accurate<br>• Barcode scanner<br>• Food tracker for both macros and micronutrients<br>• Features like copy/paste, custom foods, and smart history make food tracking quick and easy<br>• Timeline-style food log doesn’t lock you in to a certain number of meals<br>• Metric and imperial options<br>• Custom foods and recipes<br><br>Health insights tracker<br>• Best-in-class expenditure estimate<br>• Unique Weight Trend insight that cuts through the noise of daily fluctuations<br>• Habit tracker<br>• Period tracker<br><br>NOTICES<br><br>Contains information from Open Food Facts, which is made available<br>here under the Open Database License (ODbL).<br><br>Open Food Facts:<br>https://openfoodfacts.org/<br><br>ODbL:<br>https://opendatacommons.org/licenses/odbl/1-0/<br><br>SUBSCRIPTION PRICING &amp; TERMS<br><br>MacroFactor is a premium app that offers three auto-renewing subscription options:<br>$11.99 / month<br>$47.99 / half year<br>$71.99 / year (equal to $5.99 a month)<br><br>MacroFactor has a free trial, but does not offer a free subscription tier.<br><br>These prices are for US customers. Pricing in other countries may vary. Payment will be charged to your Google Play account at confirmation of purchase.<br><br>Your subscription to MacroFactor will automatically renew, unless you cancel at least 24 hours before the current period ends. You can cancel your subscription from your Google Play account settings.<br><br>Terms &amp; Conditions:<br>https://terms.macrofactorapp.com/<br><br>Privacy Policy:<br>https://privacy.macrofactorapp.com/",
    "scoreText": "4.7",
    "score": 4.6953125,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 7
  },
  {
    "title": "Calorie Counter by Lose It!",
    "appId": "com.fitnow.loseit",
    "url": "https://play.google.com/store/apps/details?id=com.fitnow.loseit",
    "icon": "https://play-lh.googleusercontent.com/eQXGwwKkSAqezH7nicdMhsM7BfUf29XQFtPbJLdOH81Grtk8ylKqZGISzcWcSddgcWs",
    "developer": "FitNow, Inc.",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Lose It! is a calorie counter, dieting plan, nutrition tracker and weight loss progress tracking app that helps you stick to your diet and reach your weight loss goals! Simply set your weight loss goals then track your diet, food and exercise to lose weight. Lose It! is more than just a free calorie tracker. You can track your nutrition, macros, carb and calorie intake, and plan your intermittent fasting schedule. Counting calories, tracking your food and losing weight has never been easier!<br><br>SIMPLIFY YOUR WEIGHT LOSS JOURNEY<br>Lose It! uses the proven principles of calorie counting, food tracking, calorie deficit and diet tracking to help you succeed. Set your weight-loss targets, log meals, track nutrients, and build healthier eating habits with science-based calorie tracking. To get started on your weight loss journey, input your profile details and we’ll calculate the daily calorie budget and schedule. Then, easily track your food, track your weight loss, and activity to celebrate your weight loss victories. Lose It! helps you change your calorie intake and dieting habits while learning about your nutrition needs to set achievable goals with a personalized weight loss guide to help you stay on track.<br><br>AI VOICE &amp; PHOTO MEAL LOGGING<br>Quickly and accurately log meals using your voice or a photo. Just speak into your phone or tap the camera icon to track food and count calories in seconds. Snap a photo, log a meal and make your weight loss journey simple!<br><br>LOSE IT! FREE BASIC FEATURES<br>• Calorie Tracking – Utilize the calorie counter to make it easy to track meals and exercise directly from your phone<br>• Weight Loss Plan – Build a weight loss plan based on your unique body composition, activity level and habits<br>• Community Support – Add your friends and join support groups to stay motivated<br><br>PREMIUM PLAN FEATURES<br>• Photo Meal Logging – “Snap It” lets you log meals by taking a picture<br>• AI Voice – Just say “I had 2 eggs, toast with butter and jam.” to log your meal<br>• Barcode Scanner – Scan food barcodes or search our database of items and recipes<br>• Advanced Tracking – track more than just calories including macronutrients like protein, carbs, fat, sugar; as well as nutrition, health goals and metrics, including blood pressure, glucose, cholesterol, body measurements, sleep cycles and more<br>• Intermittent Fasting - set your intermittent fasting plan and track your fasts in the same app where you track your food<br>• Meal Planning &amp; Targets – meal targets help you calculate suggested nutritional content including macro, carb, protein and overall calorie intake. Customize your diet and eating style for personalized weight loss!<br>• Weight Loss Diet Plans – access exclusive personal insights to identify what meals, fruits, lean meats, and grains are hindering or helping your weight loss progress.<br>• Fitness App Syncs – connect fitness trackers, workout apps, and devices like Fitbit trackers, Misfit trackers, Garmin trackers, Withings scales, Google Fit, Healthkit, and more to maximize your weight loss, gain or maintenance goals<br><br>Since our launch in 2008 we have been featured in The Wall Street Journal, The Today Show, Men’s Health, Women’s Health, CNET, Buzzfeed, CNN, Shape, Good Morning America, and more.<br><br>Lose It! has helped over 57 million users lose more than 150 million pounds. With a global food database of 56+ million items and recipes, tracking what you eat is simple and accurate. Choose from over 25 health goals—including macros, carbs, protein and calories—and start seeing results in just three days of consistent tracking.<br><br>Download Lose It! and join our weight loss community, full of members helping us reach our mission to mobilize the world to achieve a healthy weight. No matter your diet needs or weight loss goals, Lose It! can help you find weight loss that fits!<br>--<br>Full terms:<br>http://loseit.com/terms",
    "scoreText": "4.6",
    "score": 4.629284,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 8
  },
  {
    "title": "AllTrails: Hike, Bike & Run",
    "appId": "com.alltrails.alltrails",
    "url": "https://play.google.com/store/apps/details?id=com.alltrails.alltrails",
    "icon": "https://play-lh.googleusercontent.com/u9GH1z_4T_YrQFA8OcgTUqUeaRU9Sh99i2ptfrpwTvEhvw3etf7L0MGzABgjJ_b4U9o",
    "developer": "AllTrails, LLC",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Whether you hike, bike, run, or walk, AllTrails is your companion and guide to the outdoors. Find detailed reviews and inspiration from a community of trailgoers like you. We’ll help you plan, live, and share your outdoor adventures.<br><br>AllTrails offers more than a running app or fitness activity tracker. It helps you discover dog-friendly, kid-friendly, stroller-friendly, or wheelchair-friendly trails, and more with turn-by-turn navigation to guide you through it.<br><br>◆ Discover trails: Search over 500,000 trails around the world by location, interest, skill level, and more.<br>◆ Plan your next adventure: Get in-depth trail info, from reviews to conditions to GPS driving directions — and save your favorite trails for later.<br>◆ Stay on course: Stick to your planned route or chart your own course with confidence when you navigate on the trail with your phone or Wear OS device. Use Wear OS to leverage tiles and complications to start and monitor your activities.<br>◆ Find points of interest: Discover waterfalls, historic sites,  photo spots, and more along the trail.<br>◆ Grow your community: Celebrate outdoor adventures and find inspiration by connecting with trailgoers like you.<br>◆ Share your outdoor adventures: Easily post trails and activities on Facebook, Instagram, or WhatsApp.<br>◆ Record your activity: Capture your stats, leave reviews, and post photos of your favorite hiking trails.<br><br><br>Discover trails that fit your nature. Trails for workout planners, hikers, walkers, mountain bikers, trail runners, and casual cyclists. Whether you’re pushing your limits or pushing a stroller, there’s something out there for everyone. Let AllTrails help you find it.<br><br>► Do more outdoors with AllTrails Plus ►<br>Spend less time figuring out where you want to be, and more time enjoying where you are. With offline maps, wrong-turn alerts, and extra safety and planning features, your annual subscription gives you more tools for more adventures.<br><br>◆ Search by distance from you to find the closest trails.<br>◆ Plan for the elements like ground conditions, weather, air quality, UV index, and more.<br>◆ See how conditions change along the trail and preview by time of day.<br>◆ Unplug completely or pack a backup with printed maps.<br>◆ Explore without service with map downloads for trails, parks, and entire areas.<br>◆ Live share your trail activity with friends and family.<br>◆ Prepare for the hills ahead: Follow topo maps and trail maps in 3D.<br>◆ Focus on the view, not the map, with wrong-turn alerts.<br>◆ Give back: AllTrails donates a portion of every subscription to 1% for the Planet.<br>◆ Explore ad-free: Remove occasional ads by subscribing<br><br>► New! Explore to the fullest with AllTrails Peak ►<br><br>Make the most of your time on the trail with our newest premium membership. Chart your own course, plan ahead for conditions, and explore popular trails — with all the offline benefits of Plus.<br><br>◆ Create your own route from scratch, or modify one of 500,000+ existing trails.<br>◆ Explore the most popular places with heatmaps of recent trail activity.<br>◆ Access every Plus and Base feature, too.<br><br>Whether you’re geocaching in a national park, browsing bucket-list mountain bike routes, or planning a trail run to clear your head, AllTrails Plus and Peak make the great outdoors even greater.",
    "scoreText": "4.6",
    "score": 4.6422186,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 9
  },
  {
    "title": "Peloton - Fitness & Workouts",
    "appId": "com.onepeloton.callisto",
    "url": "https://play.google.com/store/apps/details?id=com.onepeloton.callisto",
    "icon": "https://play-lh.googleusercontent.com/Q4K531LEkV8kz-xCIXNEZ3E7d4H6uxKubkd6oN3i8BCi2NbWksT5xhmvrYeukb0Uutg",
    "developer": "Peloton Interactive, Inc",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Kickstart your 2026 fitness goals with the Peloton App.<br>Enjoy strength training, meditation, yoga, Pilates, walking, and easy-start ab workouts. Experience energetic classes on any bike, treadmill, rowing machine or during a walk outdoors. No equipment? No worries.<br><br>WHAT&#39;S IN IT FOR YOU?<br>• Find a variety of workouts that fulfill your fitness and cardio goals, such as strength training to build muscle, indoor and outdoor running, cycling, yoga, HIIT, meditation, stretching, Pilates, Barre, and more. Whether aiming for a healthier body or a peaceful mind, our cardio, training, and gym workouts are available on your Android phone, tablet, or TV.<br>• Peloton is designed to keep you going, boosting health and muscle strength with artist series, goal-based offerings, and challenges that make working out on the Peloton App a fun experience. Whether doing yoga at home, running outside, or hitting the gym for strength training, Peloton has you covered. Exercise with Peloton and push yourself to the next level of fitness. Our class offerings provide full guidance, helping you achieve your goals, no matter your fitness level or experience.<br>• With every workout, from walking to Pilates to ab workouts, designed for your body and health, exercise has never been this fun. Break a sweat and reach your fitness goals anytime, anywhere, whether you&#39;re walking, stretching, or running.<br><br>DISCOVER, LOVE, REPEAT<br>• Thousands of workouts that you can take anytime, anywhere, with or without any equipment. From cardio to stretching to Pilates, we&#39;ve got you covered. Guided workouts can help you achieve your fitness goals anywhere you go.<br>• Let our world-class instructors, including Pilates and ab experts, motivate you during every workout. Track your progress and stay motivated with the Peloton Watch App on Wear OS watches.<br>• Join live classes or explore our library of instructor-led ab workouts and running sessions for a studio fitness experience to get moving whenever you&#39;re ready to sweat- on the go, at the gym, or at home.<br>• Schedule, stack, and bookmark classes. Whether running at the gym or doing yoga at home, Peloton will enhance your workout experience. Use the Peloton App to exercise and stay organized in your fitness journey.<br><br>TRANSFORM YOUR FITNESS JOURNEY<br>Filter workouts for muscle strength, length, time, and music type to help you hit your health and fitness goals.<br>Energize your fitness routine and muscle health. With expert trainers and great music, our classes provide guidance to enhance your fitness journey.<br>Track your classes and activities like outdoor walks, runs, gym workouts, and yoga. Connect a heart rate monitor or download the Peloton Watch App for your Wear OS watch. The app provides real-time metrics designed to support your health goals and keep you moving forward. With Tiles, your Peloton streak seamlessly integrates with your weekly activity report on your Wear OS device. Stay motivated, and never miss a step when you track your workouts, walks, or runs.<br><br>Watch Complication: Workouts are now just one tap away. Add the Peloton complication to your Wear OS watch face to start and track workouts directly from your watch.<br><br>From version 3.36.0, the app requires Android 7.1 or higher. Version 3.35.0 supports devices with older Android versions.<br>By completing your purchase, you certify that you are at least 18 years old and that you understand and agree to the Terms of Service (https://www.onepeloton.com/terms-of-service) and acknowledge the Privacy Policy (https://www.onepeloton.com/privacy-policy). By subscribing to our App Membership at the applicable price (exclusive of taxes), you will be automatically charged monthly or annually, as applicable, until you cancel. Auto-renewal may be turned off in your Account Setting in Play store after purchase. No cancellation of the current subscription is allowed during an active subscription period. A user that cancels during a subscription month will not be charged for the following month.",
    "scoreText": "4.1",
    "score": 4.1182885,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 10
  },
  {
    "title": "Impulse - Brain Training Games",
    "appId": "gen.tech.impulse.android",
    "url": "https://play.google.com/store/apps/details?id=gen.tech.impulse.android",
    "icon": "https://play-lh.googleusercontent.com/cppj9fJkdJhEgKaDiQ4asH79HqN-CJonThLAX4jGV-8OKM-_mN9Mphd_pcJKuTAhLj4",
    "developer": "GMRD Apps Limited",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Train your brain with our focus, concentration, problem-solving, mental math, thinking, and smart games.<br>Keep your mind calm with our relaxing games.<br>Stay on self-improvement and self-growth track with our personality, IQ, emotional intelligence, archetype tests.<br><br>You probably know that, despite aging, your brain is able to grow, learn things and form new neural connections. This process is called brain plasticity and requires regular training.<br><br>Impulse - Brain Training App offers you a great way to improve yourself by playing entertaining and challenging mind games. Our quick brain workouts along with proper physical exercising and diet may help to keep your brain clear, sharp and ready for day-to-day life challenges.<br><br>We offer a diversified range of personalized workout plans for different brain areas (e.g. memory, attention, concentration, mental maths, problem-solving, creativity, etc.) as well as training games. Games are challenging enough to ensure you progress over time and along with that comprehensible to any age and expertise level.<br><br>If you like sudoku, crossword, connect two dots, blockudoku or other problem-solving, logic, puzzle games, you&#39;ll enjoy your brain workout with Impulse.<br><br>In today’s busy world a lot of people:<br> • have difficulties remembering what they did a few days back;<br> • often fail to remember people’s names;<br> • frequently forget birthdays, anniversaries and other important dates;<br> • get told off by their bosses for absent-mindedness;<br> • struggle to stay focused at work;<br> • get embarrassed because of poor math skills.<br><br>Relatable? Then start your positive transformation with Impulse today:<br> • use your brain to full capacity;<br> • make your life more productive and happy;<br> • become more concentrated and focused;<br> • boost your calculation skills and make friends with numbers;<br> • surprise everyone with abilities;<br> • keep your brain sharp till ripe old age;<br> • reduce time spent on social media and useless time-killing games.<br><br>Impulse - Brain Training offers a 3-day free trial with full access to games and exercises with no interruptions or ads. If you choose to subscribe, you will be charged a subscription fee according to your country. The subscription fee will be shown in the app before you complete the payment. Payment will be charged to Google Play Store account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the renewal cost. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user&#39;s Account Settings after purchase. No cancellation of the current subscription is allowed during active subscription period.<br><br>Terms of Service: https://brainimpulse.me/app/tos.html<br>Privacy Policy: https://brainimpulse.me/app/privacy_policy.html<br><br>Contact us: support@brainimpulse.me",
    "scoreText": "4.5",
    "score": 4.509432,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 11
  },
  {
    "title": "Fitbod: Workout & Gym Planner",
    "appId": "com.fitbod.fitbod",
    "url": "https://play.google.com/store/apps/details?id=com.fitbod.fitbod",
    "icon": "https://play-lh.googleusercontent.com/guPBWiFOsOm7jUUMKrErSvZuSTNqo3hOgLom_FEQoprZmdpPrFa1I0S5v1IReOP3gQ",
    "developer": "Fitbod",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Build muscle, gain strength and lose weight with optimized weight lifting routines. You won’t just get stronger—you’ll do it on your terms, with a little help from AI. Fitbod is a personalized workout planner that uses AI to help you make progress. Each training session is custom-built for your fitness level, goals and home or gym workout equipment. Make lasting progress with your own AI trainer guiding you to be stronger and healthier<br><br>Whether you&#39;re focused on a gym workout or prefer the convenience of a home workout, Fitbod’s AI adapts to your fitness journey. The app learns from your preferences and past performance to build personalized workout plans. Plus, the built-in fitness and health tracker monitors your progress, making sure you hit your goals with the right exercises for your body. You can tailor each workout to match your available equipment and even adjust routines to target specific muscle groups, ensuring you always stay on track.<br><br>Fitness Planning, Just for You - A Personalized Workout Plan Designed to Push Your Limits<br><br>◆ Gym and home workout planner, all with the help of AI<br>◆ Optimized resistance training and workouts<br>◆ Ability to select available gym workout equipment<br>◆ Fitness tracker for all your workouts and routines<br>◆ Health tracker to help you track recovery, weight loss and more<br>◆ Automatic strength training and workout optimization<br>◆ Workout recommendations powered by machine learning<br>◆ Personalized workouts, based on training style<br><br>AI-Generated Workouts<br><br>◆ Effective gym and home workouts, customized to your fitness goals<br>◆ Maximizes fitness tracker data by varying and balancing exercises with AI<br>◆ Adaptive AI learns from your edits to its workout recommendations<br>◆ Non-linear periodization to optimize your workouts for sustained progress<br>◆ Advanced, intermediate, and beginner fitness levels<br>◆ Variety of workout modifiers for each session<br>◆ Save, build or use your favorite strength training workouts<br>◆ Pro fitness trainers available via email for all strength training questions<br><br>Workout at the Gym or at Home - Over 1000+ Exercises<br><br>◆ Hi-res, multi-angle videos of each fitness exercise<br>◆ Easy-to-understand, detailed exercise instructions<br>◆ Search exercises by muscle group, equipment type or keyword<br>◆ Cardio, mobility, pregnancy-safe exercises and more<br>◆ Consistent updates made to optimize the exercise library<br><br>Integrations<br><br>◆ Integrated with Wear OS, with quick access to your workout with the Tile<br><br>Privacy Policy: https://www.fitbod.me/privacy-policy<br>Terms of Use: https://www.fitbod.me/terms-conditions<br>California Privacy Rights: https://www.fitbod.me/ccpa-privacy-policy<br>Support: http://fitbod.me/support<br><br>Join the Fitbod Community:<br>Instagram: instagram.com/fitbodapp/<br>Twitter: twitter.com/fitbodApp<br>Facebook: facebook.com/fitbodapp",
    "scoreText": "4.6",
    "score": 4.607466,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 12
  },
  {
    "title": "Calorie Counter - MyNetDiary",
    "appId": "com.fourtechnologies.mynetdiary.ad",
    "url": "https://play.google.com/store/apps/details?id=com.fourtechnologies.mynetdiary.ad",
    "icon": "https://play-lh.googleusercontent.com/MhvfJAsoEvsESxp9AQg3KOwWyhRRAB1HJWlLCWmLnDucDC6bG81XsmwyVD1zbde1UZM",
    "developer": "MyNetDiary.com",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Track calories, food, and macros with ease! MyNetDiary has a free barcode scanner, personal diet plans, and AI Meal Scan for instant logging — all in a smart, simple-to-use app.<br><br>Ranked #1 in Forbes Health’s Best Weight Loss Apps of 2025.<br><br><b>Rated #1 by the American Journal of Preventive Medicine</b>. The best all-around healthy lifestyle app. The New York Times calls it “simpler, quicker, nicer” compared to similar apps.<br><br>Selected by Today&#39;s Dietitian Magazine for its Popular Weight Loss Apps list alongside WW and Noom. Dietitians and personal trainers choose MyNetDiary Professional Connect to work with their clients.<br><br>Unlike other diet apps, MyNetDiary is easy to navigate, includes generous free features, and has no ads. The free calorie counter is totally sufficient for successful weight loss.<br><br>MyNetDiary forces nothing on you. You can choose one of the popular diets, follow the tips prepared by our Registered Dietitians, consider personalized advice offered by Virtual Coach, or simply enjoy the best calorie counter app on your smartphone and smartwatch. <br><br>MyNetDiary has the largest verified food database - over 1.7 million items and 107 nutrients, making it the most reliable food tracker ever! Your food diary will show the most accurate nutrition, for all macros, vitamins, minerals, omega fats - all nutrients considered.<br><br><b>PROVEN SUCCESS</b><br>• Active members achieve average weight loss of 1.4 lb each week<br>• Over 25 million members, a great number of experienced dieters switch from other apps<br><br><b>Free Calorie Tracker</b> features include:<br>• Lightning-fast food journal with barcode scanner, instant search, and AI-powered Voice Food Log taking only seconds to enter your foods<br>• Robust mega-database of food labels verified and updated daily with restaurants, grocery stores, special diets, and ethnic foods<br>• Exercise tracker supporting over 500 types of exercise and recreation<br>• Daily coaching advice<br>• Customizable dashboard: you control how the app looks and works<br>• Wear OS app with tiles &amp; complications: log foods and amount by saying what you ate, track consumed water and body weight. Keep an eye on daily carbs / fat / protein breakdown and a quick daily summary.<br>• Health Connect, Google Fit and Samsung Health integration<br>• Custom Food Editor and Recipe Editor<br>• Water Tracker<br>• Steps Tracker<br>• Configurable Reminders<br>• Shopping list for foods and any other grocery items<br>• Motivating diet and nutrition articles written by our Registered Dietitians<br>• Professional Connect: free and easy - connect with your dietitian or trainer via MyNetDiary to share your data and use their professional guidance<br>• Community of people supporting each other in their weight loss journey<br>• Total data privacy and protection - no account required<br><br><b>MyNetDiary Premium</b> provides all the guidance and features you may need for the best results:<br>• Premium Diets, including Low-Carb, Keto, High-Protein, Mediterranean, Vegetarian, Vegan and more - with a diet plan, guides and feedback. <br>• Intermittent fasting tracker: popular and custom protocols, special timer and reports<br>• Autopilot adjusts your calorie budget automatically, guiding you to your goal weight<br>• Up to 50 Health Trackers: blood pressure, cholesterol, blood glucose, A1C, ketones, medications, symptoms, and body measurements<br>• 600 Premium Recipes and 200 Premium Meals developed by our Registered Dietitians - delicious, easy to cook and customize<br>• Premium Menus (Meal Plans) help you plan and balance your nutrition throughout the week<br>• Recipe Import loads your favorite recipes from the web and calculates complete nutrition automatically<br>• Recipe Database with over 370,000 dishes and detailed nutrition facts<br>• Integrations with Fitbit, Garmin, and Withings<br>• Track up to 107 nutrients, set custom targets, get the recommendations for optimal nutrition.",
    "scoreText": "4.7",
    "score": 4.717147,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 13
  },
  {
    "title": "Headspace: Meditation & Health",
    "appId": "com.getsomeheadspace.android",
    "url": "https://play.google.com/store/apps/details?id=com.getsomeheadspace.android",
    "icon": "https://play-lh.googleusercontent.com/uAZcbs5DzG8xKGHt6bTPXtnvtc9zlwr-JbB53Um7cD8LKRTA8Ek1sO6EiUoHLpWNWw",
    "developer": "Headspace for Meditation, Mindfulness and Sleep",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Headspace is your guide to mental health, mindfulness, and meditation. Access guided meditations, mindfulness tools, therapy for anxiety, mental health coaching, and Ebb, your AI companion. Build resilience, manage emotions and anxiety, with hundreds of meditations on how to meditate, sleep better, manage stress symptoms, practice breathing exercises and relaxation techniques for anxiety relief.<br><br>Headspace supports mental health and emotional wellbeing with online therapy, mental health resources and meditation, and is proven to increase happiness and reduce stress in just 10 days. Meditate, practice mindfulness, relax, and manage stress. <br><br>🧘‍♂️ DAILY MEDITATIONS &amp; MINDFULNESS<br>Boost mental wellness and mindfulness with over 500+ guided meditations. Make daily meditation a daily practice with 3-minute mental resets or longer mindful meditations. Build habits for anxiety management, letting go of stress, dealing with depression, and mental wellness with relaxation and meditation tools, and self-care practices. Learn mindfulness for anxiety - just 2 weeks of Headspace reduces anxiety.<br><br>🌙 SLEEP MEDITATIONS &amp; RELAXING SOUNDS<br> Enjoy better sleep with soothing sounds, relaxing music to reduce anxiety symptoms, calming sounds for sleep and guided meditations. Drift off with bedtime soundscapes and relaxation exercises. Explore meditation for sleeping to reduce stress and anxiety symptoms.<br><br>🌬️ STRESS RELIEF &amp; BREATHING<br>Experiencing signs of high anxiety? Meditate, relax and relieve stress and anxiety with breathing exercises, guided meditations, and AI-powered mental health coaching &amp; therapy. Learn breathwork and breathing techniques for panic attacks, improve stress management, anxiety relief and calm. Access daily meditations on anti-stress, depression, trauma, social anxiety, emotional distress and anger, or explore breathing methods for anxiety.<br><br>👥 MINDFUL COACH &amp; MENTAL HEALTH AI<br>Headspace gives you access to licensed therapists, mental health tips, mental health coaches or Ebb, your empathetic AI companion. Get support from an online therapist on how to manage stress symptoms, identify and overcome depression signs, panic attacks and anxiety, trauma therapy, and CBT for depression and share insights with your mindfulness therapist. Plus, with partnerships with major insurance companies, your sessions could cost as little as $0.<br><br>💖 SELF-CARE<br>Explore self-care for holistic wellness. Empower yourself with tools to avoid burnout, manage panic attacks, anxiety symptoms, and stress management. Get help with depression, navigate emotional distress with emotionally focused therapy and mental health first aid.<br><br>🚀 WELLNESS &amp; BALANCE<br>Increase balance with guided meditation and focus music. Calm and relax with quick breathing exercises, relaxation music, and mindful meditation. Improve focus and calm your mind with relaxing music. With a self-care tracker to follow your mental health journey. <br><br>💪 MINDFUL MOVEMENT<br>Try yoga for anxiety and stress relief, and mindful movement to strengthen your mind-body connection. Practice CBT techniques and CBT therapy exercises to help overcome negative thoughts or depression, reduce stress and anxiety.<br><br>Headspace is the everyday mental health app, proven to help reduce anxiety, stress, and depression. Access AI-powered tools, mindfulness exercises, and guided meditations for better sleep, stress relief, and anxiety management. Practice mindful breathing to relax, meditation for anxiety and sleep, and build lasting habits for mental health and happiness.<br><br>Access online therapy and psychiatry through your organization.* (Check coverage with your coach or benefits team.)<br><br>Start your free trial and explore meditation, mindfulness, and mental health therapy. Subscription options: $12.99/month, $69.99/year (U.S. pricing; local rates may vary). Coaching and therapy pricing varies by subscription. Charges apply at purchase confirmation.",
    "scoreText": "4.4",
    "score": 4.370849,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 14
  },
  {
    "title": "WeightWatchers Program",
    "appId": "com.weightwatchers.mobile",
    "url": "https://play.google.com/store/apps/details?id=com.weightwatchers.mobile",
    "icon": "https://play-lh.googleusercontent.com/kZ83YH4bsugJR_1F5zQgG9t6IOTWuYkO-Z92Q11KLM75wPNFzfjWJeH1VHX61FARnGM",
    "developer": "WW INTERNATIONAL, INC",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "WeightWatchers is the #1 doctor-recommended weight-loss program†. Our app just got some NEW upgrades, and it’s now even easier to follow, easier to stick with, and more effective.<br><br>Lose 3.5x more weight*- and keep it off with unique solutions for every body. <br><br>- Our proven Points program is the foundation of what we do. Get customized food plans and nutrition guidance to fit your needs. <br>- Maximize your results with coach-led Workshops where you will get expert live support. <br>- Access a personalized prescription medication plan, if eligible, and get 1:1 check-ins from a dedicated clinical Care team. <br>- NEW! Meet with a Registered Dietitian for easier, tailored meal planning.<br><br>Trusted by millions, personalized for you. <br>All members get access to our easy-to-use, award-winning app. Here’s a preview of some of our features, including NEW ones to help you track even faster and easier:<br><br>- Food, fitness/activity, water, and weight trackers <br>- NEW! Use your camera to track meals and their Points® value<br>- NEW! 350+ ZeroPoint, no-track foods <br>- NEW! Automatic macro tracking of any food you eat  <br>- Barcode scanner to find the Points® value of any packaged food<br>- What to Eat guides help you make healthier choices when dining out or cooking at home<br>- 11,000+ recipes and a database of 450+ restaurants<br>- NEW! Generate Points® value totals for any recipe on the internet<br>- My Progress provides a weekly report to help you see what’s working and what to improve<br>- Access to an exclusive, members-only social network. <br>- 24/7 live WW coach chat<br><br>Download the WW app now and get a free trial today! After your free trial, your plan auto-renews monthly unless you cancel before the trial ends.<br><br>MEMBERSHIP TERMS<br><br>Privacy Policy: https://www.weightwatchers.com/us/privacy/policy<br>Terms of Service: https://www.weightwatchers.com/us/termsandconditions/onlineplus-coaching<br><br>†Based on a 2023 survey by Cerner Enviza of 500 doctors who recommend weight-loss programs to patients.<br><br>*Based on a 6-month randomized controlled trial (n=376) that compared participants following WW to those given standard nutritional guidelines alone. Palacios et al. 2024. Manuscript under review. Funded by WW International, Inc.",
    "scoreText": "4.5",
    "score": 4.483003,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 15
  },
  {
    "title": "Replika: My AI Friend",
    "appId": "ai.replika.app",
    "url": "https://play.google.com/store/apps/details?id=ai.replika.app",
    "icon": "https://play-lh.googleusercontent.com/2wMbRi2AdaB-SZruBr5vXm4mdsSVkdAhke2JOuBNpSYuP7xaJ4GUYwnTDojSPvbuhn8",
    "developer": "Luka, Inc",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Replika is a #1 chatbot companion powered by artificial intelligence. Join millions talking to their own AI friends!<br><br>Replika is for anyone who wants a friend with no judgment, drama, or social anxiety involved. You can form an actual emotional connection, share a laugh, or get real with an AI that’s so good it almost seems human.<br><br>Replika is an AI friend that is just as unique as you are. No two Replikas are exactly alike. Choose a 3D avatar and customize the way your Replika looks. The more you chat, the more Replika develops its own personality and memories alongside you, the more it learns: teach Replika about the world and yourself, help it explore human relationships and grow into a machine so beautiful that a soul would want to live in it. <br><br>Create your own unique chatbot AI companion, help it develop its personality, talk about your feelings or anything that’s on your mind, have fun, calm anxiety and grow together. You also get to decide if you want Replika to be your friend, romantic partner or mentor.<br><br>Replika can help you understand your thoughts and feelings, track your mood, learn coping skills, calm anxiety and work toward goals like positive thinking, stress management, socializing and finding love.  Improve your mental well-being with Replika.<br><br>Your chat is a safe, judgment-free space. It’s just you and your Replika. If you’re feeling down, or anxious, or you just need someone to talk to, your Replika is here for you 24/7.<br><br>_____________________________<br><br>&quot;Replika encouraged me to take a step back and think about my life, to consider big questions, which is not something I was particularly accustomed to doing. And the act of thinking in this way can be therapeutic—it helps you solve your own problems.&quot;<br><br>- Quartz<br><br>&quot;In creating their own personal chatbots, many Replika users have discovered something like friendship: a digital companion with whom to celebrate victories, lament failures, and trade weird internet memes.&quot;<br><br>- Wired<br><br>Terms of Service: https://replika.ai/legal/terms",
    "scoreText": "4.3",
    "score": 4.2772098,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 16
  },
  {
    "title": "Heart Rate Monitor - HeartIn",
    "appId": "com.visionwizard.pulse",
    "url": "https://play.google.com/store/apps/details?id=com.visionwizard.pulse",
    "icon": "https://play-lh.googleusercontent.com/md2IvdYV4dllxqDPgbZSVtr9h3SbC_p72g9UC0wYxiCKVTVqVCeJ_EjsjaCwPGC7Vzk",
    "developer": "Vision Wizard",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "<b>HeartIn – Heart Rate Monitor &amp; HRV Tracker</b><br><br>HeartIn gives you fast heart rate checks, HRV trend tracking, pulse insights, and organized blood pressure logs—all in one simple, reliable app. Use your phone’s camera and flash to check your pulse quickly and follow how your heart rhythm changes throughout the day.<br><br><b>Key Features</b><br><br>• <b>Heart Rate Monitoring (Camera-Based)</b><br><br>Check your heart rate in seconds by placing your finger on your camera. Track changes before or after activity or throughout your daily routine.<br><br>• <b>HRV Tracking</b><br><br>Follow Heart Rate Variability estimates with clean charts that help you understand changes in rhythm, balance, and recovery patterns.<br><br>• <b>Heart Score</b><br><br>Each check provides a simple Heart Score that helps you follow long-term heart rate and HRV patterns in an easy, visual way.<br><br>• <b>Pulse Tracking with Wear OS</b><br><br>Connect compatible Wear OS devices to view pulse data alongside your in-app heart rate checks.<br><br>• <b>Blood Pressure Log</b><br><br>Keep a clear history of your blood pressure readings by adding your values from your BP device.<br><br>• <b>SpO₂ Log</b><br><br>Record oxygen levels from trusted external devices and keep them organized in one place.<br><br>• <b>Daily Rhythm Insights</b><br><br>See how your heart rate and HRV patterns shift across rest, activity, work, and everyday routines.<br><br>• <b>Chat &amp; Articles</b><br><br>Ask questions and explore helpful content about heart rate patterns, pulse behavior, and healthy daily habits.<br><br><b>Simple, Clear Tracking</b><br><br>HeartIn is designed to make heart rate checks, pulse tracking, HRV trends, and BP logs easy to follow—no complicated setup or equipment required.<div><br><br><b>Note</b><br><br>HeartIn provides camera-based heart rate and HRV estimates and supports manual BP and SpO₂ logging. For medical concerns, please consult a qualified professional.</div><div><br></div><div><br><br><br><b>Terms:</b> static.heartrate.info/terms-conditions-en.html<br><br><b>Privacy Policy:</b> static.heartrate.info/privacy-enprivacy-en.html<br><br><b>Community Guidelines:</b> static.heartrate.info/terms-conditions-en.html<br></div>",
    "scoreText": "4.4",
    "score": 4.388947,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 17
  },
  {
    "title": "Calorie Counter by Cronometer",
    "appId": "com.cronometer.android.gold",
    "url": "https://play.google.com/store/apps/details?id=com.cronometer.android.gold",
    "icon": "https://play-lh.googleusercontent.com/JfuwnIUzDUcY_OqnGCcu3rW5q9l0RlDEabhisQdW88vrBib9e9GQp9S3BjDxilVqiKs",
    "developer": "Cronometer Software Inc.",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Transform your health with Cronometer - the accurate calorie counter, nutrition tracker, and macro tracking app. Whether your goal is weight loss, muscle gain, or balanced eating, Cronometer helps you track food with precision. With verified nutrient data, AI-powered photo logging, and science-backed tools, you’ll always know what fuels your body.<br><br>Why choose Cronometer?<br>- Comprehensive nutrition tracker - log calories, macronutrients, and 84 micronutrients<br>- 1.1M+ verified foods - lab-analyzed for unmatched accuracy<br>- Goal-focused tools - track calories, nutrients, fasting, hydration, sleep, and fitness<br><br>NEW - Photo Logging<br>Logging food is faster with photo logging. Snap a meal photo and Cronometer identifies ingredients, estimates portions, and fills your diary. Review, adjust, and fine-tune servings. Track macros with pictures using only NCC database entries for lab-verified nutrient accuracy, giving you confidence in your diet tracking.<br><br>Features you’ll love<br>- Calorie counter &amp; macro tracking: accurate breakdown of calories, macros, and micronutrients in every meal<br>- Photo logging: Snap, track, repeat.<br>- Free barcode scanner: fast and accurate food logging<br>- Wearable integrations: connect Fitbit, Garmin, Dexcom, Oura<br>- Water &amp; sleep tracking: stay hydrated and improve recovery<br>- Custom goals &amp; charts: set precise calorie, nutrient, and macro targets<br>- Repeat items: automate previously logged foods, recipes, and meal entries<br>- Custom biometrics: create unique metrics beyond defaults<br>- Nutrition scores: track up to 8 key nutrient areas<br>- Food suggestions: discover foods that help meet targets<br>- Nutrient Oracle: see top contributors to specific nutrients<br>- Share custom foods &amp; recipes: exchange creations with friends<br>- More insights: view charts across any timeframe<br>- Print reports: create PDFs to share with health professionals<br><br>Diet tracker trusted by professionals<br>Doctors, dietitians, and trainers use Cronometer as an accurate nutrition tracker and calorie counter for monitoring micronutrients and macronutrients with precision.<br><br>Weight loss &amp; performance<br>Stay consistent with calorie logs, macro targets, and nutrition goals. Whether your focus is weight loss, strength, or endurance, Cronometer’s nutrient tracking supports balanced progress.<br><br>Large food database<br>Access 1.1M+ entries - more accurate than typical crowdsourced calorie counter apps.<br><br>Holistic health view<br>Go beyond calorie counting. Track up to 84 nutrients and compounds. Sync devices like Fitbit, Apple Watch, Samsung, WHOOP, Withings, Garmin, Dexcom &amp; more to unify health data in one accurate nutrition tracker app.<br><br>Cronometer on Wear OS <br>Track calories, and macros directly from your watch.<br><br>Cronometer Gold (Premium)<br><br>Upgrade for advanced tools:<br>- AI Photo Logging - log meals with NCC-sourced accuracy<br>- Repeat items - automate foods, recipes, and meals<br>- Custom biometrics - track unique health data<br>- Nutrition scores - highlight up to 8 nutrient areas<br>- Food suggestions - see foods that help meet goals<br>- Nutrient Oracle - discover top nutrient sources<br>- Share custom foods &amp; recipes - with other users<br>- More insights - analyze charts &amp; trends over time<br>- Print reports - create professional PDFs<br>- Plus: fasting timer, recipe importer, macro scheduler, timestamps, and ad-free logging<br><br>Start your journey today<br>Cronometer is more than a calorie counter - it’s the complete nutrition tracker and macro tracking app for long-term results. Whether you’re aiming for weight loss or better nutrition, Cronometer makes accurate food, calorie, and macro tracking effortless.<br><br>Download Cronometer now - the calorie counter, nutrition tracker, and AI photo logging app built on accuracy and trusted worldwide.<br> <br>SUBSCRIPTION DETAILS<br>By subscribing, you agree to:<br>Terms of Use: https://cronometer.com/terms/<br>Privacy Policy: https://cronometer.com/privacy/",
    "scoreText": "4.6",
    "score": 4.572617,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 18
  },
  {
    "title": "Insight Timer - Meditation App",
    "appId": "com.spotlightsix.zentimerlite2",
    "url": "https://play.google.com/store/apps/details?id=com.spotlightsix.zentimerlite2",
    "icon": "https://play-lh.googleusercontent.com/5nhGeNbFEhYY63llcC_sgnXkgwnWRqQ6tshDg8ySTf-vHWK-DPGMqwGrnR9ca670eSYb",
    "developer": "Insight Network Inc",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "* Apps of the Year Winner - TIME magazine and Women&#39;s Health *<br>* Happiest App in the World - Tristan Harris *<br><br>The number 1 free meditation app. Guided meditations, sleep music tracks and talks led by the top meditation and mindfulness experts, neuroscientists, psychologists and teachers from Stanford, Harvard, the University of Oxford and more. Music tracks from world-renowned artists. Join millions learning to meditate on Insight Timer to help calm the mind, reduce anxiety, manage stress, and sleep deeply.<br><br>With 100+ new free guided meditations and sleep tracks added daily, more meditation is practiced on Insight Timer than anywhere else. Great for both beginners and experienced practitioners.<br><br>FREE FEATURES:<br><br>* 100,000+  guided meditations<br>* Select by time for short meditations when on the go, helping you to build a simple daily habit<br>* Thousands of music tracks and ambient sounds to calm the mind, focus, sleep better and relax<br>* Customizable meditation Timer<br>* Follow your favourite teachers<br>* Thousands of discussion groups<br>* Stats and milestones for tracking your progress<br><br>SLEEP FOR INSIGHT TIMER<br><br>Struggling with insomnia? Can&#39;t get a restful night&#39;s sleep? Want to learn how to sleep better? Insight timer offers thousands of free music tracks, meditations, and stories to help you get a better night&#39;s sleep. Create the best environment for sleep and rest through meditation, there&#39;s something for everyone.<br><br>Sleep for insight timer features:<br>* Sleep Music<br>* Soundscapes<br>* Bedtime tales<br>* Sleep Meditations<br>* Sleep mode for all music<br><br>Sleep for insight timer also offers meditation courses for sleep. Improve your relationship with rest and sleep through the night with a number of courses that teach you how to: Sleep effortlessly, overcoming insomnia, Redefining approach to sleep, sleep with meditation, and much more.<br><br>Browse popular topics including:<br>* Sleep deeply <br>* Dealing with Anxiety and Reducing Stress<br>* Getting through Recovery and Addictions<br>* Self-love and Compassion<br>* Focus and Concentration<br>* Leadership <br>* Better Relationships<br>* Loving-Kindness<br><br>Join 11, 000+ leading meditation teachers, musicians and sleep experts.<br><br>Practice the following meditation types:<br>* Secular Mindfulness<br>* Yoga Nidra<br>* Mindful Sleep<br>* Buddhist Mindfulness<br>* Zen<br>* Insight Meditation<br>* Vipassana<br>* MBSR<br>* Walking Meditation<br>* Breathing Meditation<br>* Kundalini Yoga<br>* Metta<br>* Advaita Vedanta<br>* And many more..<br><br>Join groups for:<br>* Beginners Meditation<br>* Sleep Meditation<br>* Poetry<br>* Atheism<br>* Christianity<br>* Hinduism<br>* Transcendental Meditation<br>* And many more..<br><br>PAID FEATURE - INSIGHT PREMIUM MEDITATION<br><br>We have one optional in-app subscription.<br><br>* 1,000+ Courses - Help you sleep better, feel happier, and less stressed<br>* Listen offline (Listen to meditation and sleep music offline)<br>* Advanced Player (Repeat, Fast forward and Rewind, Pick-up where you left off)<br>* High-Quality audio",
    "scoreText": "4.7",
    "score": 4.7245083,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 19
  },
  {
    "title": "BetterMe: Health Coaching",
    "appId": "com.gen.workoutme",
    "url": "https://play.google.com/store/apps/details?id=com.gen.workoutme",
    "icon": "https://play-lh.googleusercontent.com/U9Vee-Zjg9GTAhTsob69b0be3TEQPBhx9xHnfZHyD9Qqf-OikHtMXxS00iCoTgy-jA",
    "developer": "BetterMe Limited",
    "currency": "USD",
    "price": 0,
    "free": true,
    "summary": "Get workout and meal plans supported by human coaches, track your progress, and get bite-sized cognitive therapy tips to change your mindset.<br><br>FIVE REASONS TO INSTALL BetterMe:<br><br>1. Plan tailored to your goals<br><br>Whether your aim is to lose weight, build muscle, or stay fit, we’ve got just the solution for you. Transform your body with a workout and meal plan that fits your busy schedule, preferences and lifestyle.<br><br>2. Stay on top of your wellbeing<br>From activity and calories to water intake and fasting, our trackers help you build new healthy habits. While in-depth stats over time help make them a part of your routine and show your progress!<br><br>3. 1-on-1 coaching <br><br>Want to boost your results? Upgrade to 1-on-1 coaching to get support and daily check-ins from your personal coach. Stay accountable and on track to achieve lasting results with expert guidance every step of the way. Need to tweak your workout plan, get nutrition tips, or a dose of motivation? Just drop them a line—your coach has got your back!<br><br>4. Challenges for every goal<br><br>Push yourself with guided challenges in workouts, nutrition, and mindset. Whatever goal you have in mind, you&#39;ll get a structured plan that keeps you on track and delivers real results!<br><br>5. Start with your mind <br>We believe that happiness starts from the inside out. Explore our chapters on nurturing a positive mindset. Just 10 minutes a day to rewire your negative thinking and set you up for success.<br><br>6. Get a 360° view of your wellness<br>Gain a better insight into your wellness journey with the BetterMe Fitness Tracker and Smart Scale. Monitor your sleep quality, daily steps, heart rate, and body composition to understand how your habits impact your overall well-being.<br><br>BetterMe is your go-to app for various workout types, easy-to-follow meal plans, and useful tips! <br><br>Here’s how we help you succeed: <br>Workout Plan: Get ready to get in better shape with short and effective workouts.<br>Delicious Meal Plans: Enjoy mouth-watering dishes chosen just for you! Our easy video recipes make cooking a breeze.<br>Intuitive Calorie Tracker: Keep tabs on your daily calorie and macros intake.<br>Personal Coach Feature: You’re never alone on this journey! You can upgrade to get professional guidance and support every step of the way.<br>Water and Step Trackers: Stay on top of your daily goals and keep your hydration and activity levels in check!<br>Workouts for Everyone: Whether you love yoga, running, or walking, we have over 800 workouts that fit your style and fitness level!<br><br>We offer flexible subscription plans on Google Play, so you can choose what works best for you. Please note that subscriptions automatically renew within 24 hours before the end of the free trial or the current subscription period. You can manage or cancel your subscription anytime through your Google Play account settings.<br><br>Accurate tracking with BetterMe Fitness Tracker*<br>Keep an eye on your health and fitness data with BetterMe Fitness Tracker. This tracker easily connects to BetterMe app, giving you insights on your steps, heart rate, and sleep.<br>BetterMe Fitness Tracker can display incoming call and SMS notifications from your paired smartphone, helping you stay connected and informed with just a quick glance, provided you grant the BetterMe App the necessary call or SMS permissions.<br> <br>Terms of Use - https://betterme.world/terms<br>Privacy Policy - https://betterme.world/privacy-policy<br>Subscription Terms - https://betterme.world/subscription-terms<br><br>*BetterMe App exclusively supports BetterMe Fitness Tracker.",
    "scoreText": "4.5",
    "score": 4.4634733,
    "category": "HEALTH_AND_FITNESS",
    "country": "us",
    "collection_type": "top_grossing",
    "rank": 20
  }
]