[
  {
    "title": "Super Sandbox Games",
    "appId": "com.VisionGames.SuperSandbox",
    "url": "https://play.google.com/store/apps/details?id=com.VisionGames.SuperSandbox",
    "icon": "https://play-lh.googleusercontent.com/oEbMbA2-2rLimtD4IbtK4WUTzXXimnFMIGPdKcQL5EjzDjlX_rp8P7wbKqVWvSkV2Q",
    "developer": "Funburstgame LTD",
    "currency": "VND",
    "price": 0,
    "free": true,
    "summary": "Super Sandbox Games is a unique sandbox games that offers endless possibilities for creativity and fun. In this exciting destruction playground simulator, you will have full control over the environment and a variety of tools, shoot weapons, to create your own playground open world and participate in epic multiplayer people sanbox battles. Immerse yourself in an open world made of blocks &amp; vehicle that you can rebuild as you wish. Use interactive scrap objects and elements to create unique tools structures. Build a shelter for protection or construct giant buildings to surprise your friends. The destruction playground simulator offers a wide range of shoot weapons for every taste. Want to create real chaos? Use firearms, scrap tools, explosives, or even fantastic shoot weapons! Killing people becomes not only fun, but also strategically thought out. With each new people battle, discover new tactics and vehicle challenges. Join friends to explore the open world together or arrange fierce sanbox battles. Battles become even more interesting when there are allies or rivals nearby. Think over tactics, use the environment to your advantage and prove that you are the best scrap tools builder and fighter.<br><br>Super Sandbox Games features:<br><br>— A fully customizable open world of scrap blocks;<br>— A wide range of shoot weapons for people sanbox battles and experiments;<br>— The ability to build shelter and create protective tools structures;<br>— An interactive environment that can be used to win;<br>— Multiplayer mode – play with friends;<br>— Simple controls &amp; vehicle control that are suitable for all ages;<br>— Fast vehicle for every taste.<br><br>Enter large-scale sanbox battles that turn a familiar sandbox into an arena of exciting action. Organize a real epic war with dozens of people opponents, destroying them with shoot weapons and scrap traps. Only your ingenuity decides the outcome of these sanbox battles on the open world. This destruction playground simulator is not only a sandbox games, but also a full-fledged simulator of freedom of action. Create your own laws, build, destroy and experiment. Your possibilities are limited only by your imagination!<br><br>This destruction playground simulator is the perfect combination of creativity, strategy and action. Relax while creating architectural masterpieces or test your strength in dynamic sanbox battles. Thanks to a unique system of interaction with the environment, each session in Super Sandbox Games is a new adventure full of surprises.",
    "scoreText": "3,7",
    "score": 3.7307692
  },
  {
    "title": "Block City 3D: Giả lập",
    "appId": "com.blockgamesstudio.blockcity3d",
    "url": "https://play.google.com/store/apps/details?id=com.blockgamesstudio.blockcity3d",
    "icon": "https://play-lh.googleusercontent.com/0K-Pc4N0IiAtIOH5lacm-VJ7-R2bfPaiuJH5xT9_HaxQI9XkbMEfDasvxvELxc2WA7o",
    "developer": "Funburstgame LTD",
    "currency": "VND",
    "price": 0,
    "free": true,
    "summary": "Block City 3D là một trò chơi tiệc tùng trong thành phố hộp cát, nơi bạn có thể tạo ra tính cách độc đáo của mình, xây dựng ngôi nhà của mình theo phong cách thủ công khối, nhận phương tiện yêu thích, tìm việc làm và kết bạn với nhiều người.<br><br><b>BIỂU DIỆN</b><br>Cá nhân hóa nhân vật của bạn trong trò chơi thủ công này bằng cách chọn từ nhiều phong cách, kiểu tóc, quần áo và phụ kiện khác nhau. Tạo giao diện độc đáo, nổi bật trong trò chơi thế giới mở này và thể hiện cá tính của bạn.<br><br><b>TÒA NHÀ</b><br>Trong trò chơi xây dựng này, hãy xây dựng ngôi nhà của bạn bằng nhiều khối khác nhau, thể hiện tinh thần của thế giới thủ công. Trang trí nó với đồ nội thất và phụ kiện phản ánh phong cách của bạn. Trải nghiệm xây dựng và phá hủy sáng tạo này mang đến sự kết hợp hoàn hảo giữa thủ công tiệc tùng.<br><br><b>VẬN CHUYỂN</b><br>Khám phá thành phố pixel này bằng nhiều phương tiện khác nhau mà bạn có thể mua trong trình giả lập này. Từ siêu xe đến máy bay trực thăng, hãy tận hưởng sự tự do di chuyển và tốc độ.<br><br><b>THÚ CƯNG</b><br>Tìm và thuần hóa nhiều loại vật nuôi. Những người bạn đồng hành trung thành này sẽ đồng hành cùng bạn trong các cuộc phiêu lưu chế tạo khối. Chăm sóc chúng, chơi và huấn luyện chúng, và chúng sẽ trở thành những người bạn tận tụy của bạn trong trò chơi vui nhộn này.<br><br><b>VAI TRÒ</b><br>Kiểm tra bản thân trong các vai trò khác nhau trong trò chơi hộp cát này. Chọn ngành nghề và nhận công việc trong thành phố, trở thành thợ thủ công, cảnh sát, lính cứu hỏa, doanh nhân hoặc các nhân vật khác, mỗi người có những nhiệm vụ và khả năng riêng.<br><br><b>GIAO TIẾP</b><br>Tương tác với những người chơi khác thông qua trò chuyện hoặc giọng nói. Chia sẻ kinh nghiệm, tạo nhóm, tổ chức các bữa tiệc tại nhà hoặc chỉ trò chuyện để mở rộng vòng kết nối xã hội của bạn trong thành phố tiệc tùng này và tận hưởng tương tác xã hội.<br><br><b>GIẢI TRÍ</b><br>Thưởng thức một loạt các bữa tiệc trong thành phố. Tham gia vào các trò chơi nhỏ, cạnh tranh trong các cuộc đua, khiêu vũ hoặc đơn giản là khám phá các điểm tham quan của thành phố.<br><br><b>NHIỀU NGƯỜI CHƠI</b><br>Chơi trò chơi nhiều người chơi này với bạn bè của bạn hoặc những người chơi khác trực tuyến. Tham gia các đội, cạnh tranh trong các chế độ khác hoặc chỉ đơn giản là tận hưởng việc khám phá thành phố cùng nhau trong trò chơi chế tạo và xây dựng này. Sự tương tác nhiều người chơi bổ sung một khía cạnh mới cho trò chơi và mang đến cơ hội hợp tác và vui vẻ.<br><br><b>Tham gia và chơi cùng với hàng triệu người chơi từ khắp nơi trên thế giới!</b>",
    "scoreText": "3,8",
    "score": 3.7692308
  },
  {
    "title": "Block Guns 3D: Online Shooter",
    "appId": "com.blockgamesstudio.blockguns3d",
    "url": "https://play.google.com/store/apps/details?id=com.blockgamesstudio.blockguns3d",
    "icon": "https://play-lh.googleusercontent.com/bG_GfD1FCk7izK3eZfImiPJcqrKFihCvb7Htt6PEDXkwFPBbg91Atz8fCvfLKnRNa0YH",
    "developer": "Funburstgame LTD",
    "currency": "VND",
    "price": 0,
    "free": true,
    "summary": "Block Guns 3D is a third-person multiplayer gun game shooter online in pixel style that you can play alone or with friends. Many modes, maps, guns, armor, skins and many different gifts and bonuses!<br><br>MODES<br>Many game modes, play alone or coop with friends, one against all, or team by team. Choose any mode and play any map.<br>Death Match, Team Match, Duel, Survival Zombie Game, Capture the Flag, Raid, Siege, Battle Royale Match, Free Play.<br><br>CARDS<br>We have created the best locations for you, from the smallest ones to arrange a meat grinder, to the largest ones to hunt down the enemy or find cover. Choose your favorite cards, memorize and use the knowledge of the card against enemies.<br>Swimming pool, Factory, Military base, Ship port, Space port, Stadium, Airport, City<br><br>WEAPON<br>Choose any pixel gun you want, whether you want to go ahead and get pistols and a couple of grenades or find cover and grab a sniper rifle. Set off a loud explosion or a quiet sniper shot.<br>Melee, Pistols, Assault rifle, Sniper rifle, Grenade launchers, Grenades<br><br>ARMOR<br>Be sure to buy a full set of armor to protect yourself from enemy shots. The steeper the armor, the harder it is for enemies to destroy you.<br>Helmet, Body Armor, Gloves, Boots.<br><br>SKINS<br>Over 500 unique skins to choose from. Choose any skin and show it to all your friends. Let all enemies remember your cool skin!<br>Boys, Girls, Military, Movies, Cartoons, Games, Camouflage, Anime.<br><br>All this and much more you will find in our game. Join millions of players worldwide in multiplayer game, download and play Block Guns 3D!",
    "scoreText": "4,7",
    "score": 4.714286
  },
  {
    "title": "Merge Gallery - Puzzles",
    "appId": "com.appladder.merge.gallery",
    "url": "https://play.google.com/store/apps/details?id=com.appladder.merge.gallery",
    "icon": "https://play-lh.googleusercontent.com/X-WbqXzTKQRO0AJc4w4w6CUJYwyxKKWGWJT-LbcblqH087Vf5vgqcd7ERfW0dYT-C9M",
    "developer": "Funburstgame LTD",
    "currency": "VND",
    "price": 0,
    "free": true,
    "summary": "Restore a legendary gallery, solve mysterious cases, find items, enjoy satisfying house cleaning, and let your creativity shine in one of the most captivating merge games ever created, combined with a thrilling storyline! Dive into a world where art meets mystery, and every puzzles is a step closer to the truth. Welcome to a place where merge mechanics, detective games, and home design collide to tell a compelling story you won’t forget.<br>Restoration project, decorating — it’s my story and home design, filled with curious clues, drew picture, and unexpected twists. Merge Gallery - Puzzles your journey begins with a single brushstroke, and every move you make brings life back to the gallery.<br>This isn’t just about solving free puzzles — it’s about my story blending art, mystery, and heart.. Combined broken brushes, find items, Merge Gallery - Puzzles, cracked statues, and old paint cans to bring legendary paintings back to life. Each object you merge reveals another piece of the puzzles and draws you deeper into the story.<br>You’ll also meet a charming cast of characters, each with their own piece of the past — and maybe a motive. Only your skills in solving puzzles and your drew pictures can help piece together the bigger picture In this my story detective games. As you restore each gallery wing, you&#39;ll uncover hidden notes, lost diaries, and cryptic symbols. What starts as simple house cleaning quickly turns into a thrilling adventure through time.<br>Peculiarities:<br> — Solve clever puzzles, uncover long-lost artworks<br> — Use the power of merge to find items, clean, drew, and restore beautiful rooms<br> — From dusty corners to glittering halls, your talents in house cleaning, decorating, and art restoration will be put to the ultimate test<br> — The game combined the joy of merge games with the thrill of detective games, wrapped in a stunningly design environment<br> — Use your eye for home design to decorating each room of the gallery in a way that reflects its rich history. <br>Merge Gallery - Puzzles every corner you restore, every object you merge, and every canvas you revive brings you closer to the truth.Use logic and creativity to find items that fit into the bigger story and drew beautiful pictures. Whether it’s a broken vase or a dusty palette, everything can be combined to uncover new surprises.<br>Get ready to merge brushes and house cleaning. The intuitive merge games mechanics are easy to learn but offer endless depth. Whether you’re looking for satisfying free puzzles or an emotional tale driven by art and secrets, this is the game for you. And the best part? My story — It’s entirely free to play In this detective games!<br>Let your imagination guide you through vibrant galleries that you can customize through home design choices, inspired by the masterpieces that once drew crowds from around the world. Choose wallpapers, furniture, and even sculptures that fit the theme of each room. Your talent for decorating and find items will transform the space from ruins into a breathtaking work of art.<br>The fusion of detective games and home design ensures that every session feels fresh, engaging, and meaningful.<br>Download now to begin my story — a journey that combined restoration, mystery, and art into one unforgettable adventure. Whether you&#39;re a fan of merge games, curious to test your skills in puzzles, or love the satisfying progress of house cleaning and decorating, this game delivers something special. It’s time to restore, solve, decorating, and dive into one of the most immersive merge games ever design.",
    "scoreText": "4,7",
    "score": 4.6944447
  },
  {
    "title": "Sort Life - Organizing Game",
    "appId": "com.sortlife.organizing.satislife.puzzle.sort.game.perfect.asmr",
    "url": "https://play.google.com/store/apps/details?id=com.sortlife.organizing.satislife.puzzle.sort.game.perfect.asmr",
    "icon": "https://play-lh.googleusercontent.com/hKZW4O_hvZPp2xszmBf2TBmBL5RW5RjZscPZHULxVYGAzjjq3m8E5ciaRo7asYnKky4",
    "developer": "Funburstgame LTD",
    "currency": "VND",
    "price": 0,
    "free": true,
    "summary": "If you love sorting games and home organization, enjoy the thrill of cozy logic puzzles,  organization games and find satisfaction in perfect home organization, this is your organization games.  Organize chaotic environments, from groceries to arranging clothes in the closet. Each challenge combines brain puzzle and satisfying to entertain and sharpen your mind<br>The Story: Tidy Up or Let the Chaos Rule<br><br>Sorting game your task is to restore order to various messy spaces. You’ll be a closet organizer, a fridge organizing expert and more in organization games<br>As you progress in this tidy cleaning games through levels for kids, you&#39;ll sort items, clean surfaces, brain training and solve brain puzzle challenges. get harder, testing your memory, focus, and problem-solving abilities<br>Sharpen Your Mind with Every Challenge<br>than just another cleaning game / satisfying<br> — it&#39;s a brain training that stimulates your mind. Every level puzzles for kids presents tasks that demand focus<br>— Goods sorting Organize items by size, type. Whether it&#39;s food in the fridge organizing task or clothes in a closet, efficient  helps you progress on closet organizer<br>— Logic puzzles Solve logic puzzles that require critical thinking to organize spaces efficiently home organization<br>— OCD If you love tidy precision, these  will test your ability to align and arrange everything perfectly ocd <br>— Rebus Solve tricky brain puzzle by thinking outside the box and finding hidden patterns<br>— Clean surfaces, remove clutter, and organize items. The perfect blend of satisfying and a brain challenge<br><br><br>Variety of Tasks to Keep You Engaged<br>This is cozy brain training each level introduces new challenges in this satisfying:<br>— Goods sorting: sort Organize clothes, food, or random objects by category and closet organizer. Can you do it quickly and efficiently?<br>— Clean After sorting, cleaning games the tidy area. Wipe down counters, sweep floors, or remove extra items<br>— Сhallenges Solve clever brain puzzle that require critical thinking about how to organize objects<br>— OCD organization These ocd appeal to perfectionists, as you align everything perfectly and clear the space<br>— Fridge organizing Can you arrange food in a way that maximizes space, fridge organizing and keeps everything in order?<br><br><br>Boost Your Brainpower<br>This is sorting games to improve cognitive abilities while having fun. All task enhances:<br>— Memory Keep track of categories and items in closet organizer, improving short-term memory in this organization games<br>— Logic Solve logic puzzles that sharpen your reasoning and strategic thinking brain puzzle<br>— Attention to detail The more you sort, the more attention this ocd you’ll pay to small cozy details<br>— Focus Goods sorting relaxing aspect of tidy while also challenging your mind<br><br><br>Why You’ll Love This<br>— For all ages: Whether you’re a kid do yo like this cozy cleaning games and organization games, there are levels for everyone. Puzzles for kids and complex challenges for adults and fans of puzzles for adults<br>— Free to play Experience all the fun and brain challenges for free sorting games and cleaning games, with no hidden costs, goods sorting<br>— Engaging content Endless levels in this puzzles for kids that get more challenging, keeping you engaged in brain training<br>— Satisfying experience transform from chaos to order. Completing each task home organization is rewarding<br><br><br>Conclusion: Sort, Solve and Succeed<br>If you love cozy logic puzzles, home organization, brain training, and cleaning games, this puzzles for kids has it all. With tasks like goods sorting, closet organizer, and fridge organizing, every level — new challenge in this sorting games organization<br>Sort, organize — start your brain training!",
    "scoreText": "3,6",
    "score": 3.5714285
  },
  {
    "title": "Chicken Attack - Gun Shooter",
    "appId": "com.chicken.shooter.gun.pixel.block.fps.pistol.polygon.game",
    "url": "https://play.google.com/store/apps/details?id=com.chicken.shooter.gun.pixel.block.fps.pistol.polygon.game",
    "icon": "https://play-lh.googleusercontent.com/xOSeF3BU4czkDUrrc6HJPLvo1N5Wk1PyxKhF9e3EUnQxDMc0RlXVDDu9vSFgX6ikEMM",
    "developer": "Funburstgame LTD",
    "currency": "VND",
    "price": 0,
    "free": true,
    "summary": "Welcome to the ultimate polygon pixel shooter and chicken games, where fearless warriors fight intense 5v5 battles! If you love guns and fast-paced combat, this is the perfect fps for you. Grab your pistol, choose your side, and dive into crazy voxel warfare filled with strategy and non-stop action fps!<br>Crazy blocky and fun shooting games!<br>Imagine a battlefield where a brave warrior armed with a pistol faces off against a squad of feathered fighters in intense 5v5 skirmishes! This isn’t just another guns shooter — it’s a full-fledged pixel and shoot that blends elements of polygon warfare and high-energy firefights. This will give you fun shooting games.<br>With a variety of weapons, block-style environments, and thrilling multiplayer chicken games action, every match turns into an unforgettable voxel showdown!<br>Intense Combat Experience<br>Get polygon pistol and ready for dynamic fps where speed, precision, and strategy are key! Each fight in this pixel shooter is unpredictable — one moment you’re dodging attacks, the next you’re launching a counterstrike. Every encounter tests your guns shoot reflexes, teamwork, and survival instincts. Whether you&#39;re engaging in close-range duels or launching long-range assaults, every match - fun shooting games 5v5, feels fresh and exhilarating.<br>chicken blocky features<br>This action shoot for pixel minecraf is inspired by the best action-packed experiences, offering a unique challenge for fans of multiplayer warfare. Here’s what awaits you:<br>5v5 polygon chicken games fights – Join forces and outplay opponents in tactical fps!<br>Blocky Environments – Navigate detailed voxel landscapes full of obstacles and cover!<br>Powerful guns arsenal – Equip everything from a trusty pistol to high-powered rifles!<br>Fast-Paced Combat – Run, jump, and take down enemies in a thrilling pixel shooter world!<br>fun shooting games – Unlock skins and personalize your warrior for maximum style!<br>Master Different Weapons!<br>A true battle for pixel minecraf champion needs the right pistol for battle. This fast-paced action shooter lets you choose from a diverse selection of firepower. Whether you prefer precision shots or high-impact attacks, there’s a perfect option for every playstyle. Adapt to the battlefield, switch tactics, and claim victory!<br>Chicken games fps in Unique Locations<br>Fight across various polygon maps designed with blocky and voxel aesthetics. Each environment offers different  challenges, requiring strategic positioning, quick guns shoot reflexes, and teamwork for pixel minecraf battlefield. Dominate abandoned warehouses, futuristic arenas, and chaotic outdoor zones where no place is safe!<br>Why You’ll Love this fun shooting games<br>Epic 5v5 Showdowns – Team up and defeat rivals in heated clashes!<br>Massive pistol arsenal of Weapons – Try out different tools to dominate battles!<br>Classic pixel shooter Combat – Inspired by the most thrilling chicken games!<br>Join the Ultimate voxel shoot !<br>If you love blocky, pixel minecraft and fast-paced action, guns and competitive multiplayer fights, this pixel shooter is for you! Step into the war zone, sharpen your skills, and prove you have what it takes to dominate. The battlefield is waiting—are you ready to become the ultimate pixel minecraft champion?"
  }
]